<?php
//2016-07-15 미처리된 신고내역을 개별 php파일로 저장. by Bryan Park
//index.php 에 include 되게끔 제작.

?>

<section>
		<h2>처리하지 않은 신고 목록 ( 확인후 조치해 주세요 )</h2>

		<div class="tbl_head01 tbl_wrap">
				<table>
				<caption>처리하지 않은 신고 목록</caption>
				<thead>
				<tr>
					<th scope="col">번호</th>
					<th scope="col">신고한 회원</th>
					<th scope="col">신고 받은 회원</th>
					<th scope="col">신고구분</th>
					<th scope="col">신고사유 / 메모</th>
					<th scope="col">신고날짜</th>
				</tr>
				</thead>
				<tbody>

<?php
		#########################################################
		# 시작 => 신고_목록
		#########################################################

			#######################################################
			# 시작 => 상수__변수__배열
			#######################################################

			//=====================================================
			// 신고_목록__건수
			$report_active_s__new = "접수";


			//=====================================================
			// 신고_목록__배열
			$report_list_arr = array();

			#######################################################
			# 끝 => 상수__변수__배열
			#######################################################



			#######################################################
			# 시작 => 신고_목록__가져오기
			#######################################################

			//=====================================================
			// 신고_목록__가져오는__쿼리문
			$sql	 = "SELECT COUNT(*) FROM `".$piree_table['report_list']."` ";
			$sql	.= "WHERE active_s='".$report_active_s__new."'";
			$total = sql_efv($sql);

			#######################################################
			# 끝 => 신고_목록__가져오기
			#######################################################

			###########################################################
			# 시작 => 페이징 추가
			###########################################################
			//2016-07-21 검색 분류를 추가하기 위한 SQL문 변경사항 적용. by Bryan Park
				$menu = (isset($_GET['menu']))? $_GET['menu'] : "untreated";
				// 2016-07-11 신고목록 가져오는 쿼리문 by Bryan Park

				$rows = $config['cf_page_rows'];
				$total_page  = ceil($total / $rows);  // 전체 페이지 계산
				if ($page < 1) { $page = 1; } // 페이지가 없으면 첫 페이지 (1 페이지)
				$from_record = ($page - 1) * $rows; // 시작 열을 구함
				// 리스트_URL
				$qstr .= "&bid={$bid}&bno={$bno}&menu={$menu}";
				$page_url_s = "{$_SERVER['SCRIPT_NAME']}?$qstr";
				//sql에 페이징 적용.
				$sql_limit = " limit {$from_record}, {$rows}";

			###########################################################
			# 끝 => 페이징 추가
			###########################################################

			#######################################################
			# 시작 => 신고_목록__불러오기
			#######################################################
			IF ($total > 0)
			{

				//===================================================
				// 신고하기__설정_정보__불러오기
				$sql		= "SELECT * FROM `".$piree_table['report_list']."` ";
				$sql	 .= "WHERE active_s='".$report_active_s__new."' ORDER BY regi_time_n DESC  limit {$from_record}, {$rows} ";
				$result = sql_query ($sql);

			}
			#######################################################
			# 끝 => 신고_목록__불러오기
			#######################################################

		#########################################################
		# 끝 => 신고_목록
		#########################################################

		//=====================================================
		// 시작 => 신고_목록__유무
		IF ($total > 0)
		{

			#####################################################
			# 시작 => 신고_목록__있으면
			#####################################################

			//===================================================
			// 시작 => 반복문
			FOR ($i=0; $row=sql_fetch_array($result); $i++)
			{

				//=================================================
				// DO_회원
				$in_do_mem_s = get_sideview($row['do_mem_id'], $row["do_mem_nick"]);


				//=================================================
				// GET_회원
				$in_get_mem_s = get_sideview($row['get_mem_id'], $row["get_mem_nick"]);


				//=================================================
				// 신고_사유__번호
				$reason_n = $row["reason_n"];


				//=================================================
				// 신고_사유__제목
				$reason_s = $reason_arr[$reason_n];


				//=================================================
				// 신고_사유__제목
				$title_s = stripslashes($row["title_s"]);


				//=================================================
				// 신고_구분
				$report_prog_arr = get__report_div($row["prog_div_c"], $row['bo_table']);


				//=================================================
				// 신고_링크__가져오기
				$arti_link_s = get_report_row_url('admin_url', $row["prog_div_c"], $row['bo_table'], $row["arti_n"], $row["parent_n"], $row["get_mem_id"]);


				//=================================================
				// 신고일시
				$regi_time_s = date("y.m.d H:i:s", $row["regi_time_n"]);


				//=================================================
				// 내부링크
				$in_link_s = "pi__report.list.php?report_n=".$row['num'];

?>
				<tr>
					<td><?php echo $row['num'] ?></td>
					<td><?php echo $in_do_mem_s ?></td>
					<td><?php echo $in_get_mem_s ?></td>
					<td><a href="<?php echo $arti_link_s ?>" target="_blank"><?php echo $report_prog_arr["prog_s"] ?></a></td>
					<td>
						<span class="font_777">사유</span> <a href="<?php echo $in_link_s ?>"><?php echo $reason_s ?></a>
<?php

					//===============================================
					// 시작 => 메모__있으면
					IF ($row["report_memo_s"])
					{
						// 메모
						$in_report_memo_s = stripslashes($row["report_memo_s"]);
?>
						<br />
						<span class="font_777">메모</span> <a href="<?php echo $in_link_s ?>"><?php echo $in_report_memo_s ?></a>
<?php

					}
					// 끝 => 메모__있으면
					//===============================================

?>
						<br />
						<span class="font_777">제목</span> <a href="<?php echo $arti_link_s ?>" target="_blank"><?php echo $title_s ?></a>
					</td>
					<td><?php echo $regi_time_s ?></td>
				</tr>

<?php
			}
			// 끝 => 반복문
			//===================================================

			#####################################################
			# 끝 => 신고_목록__있으면
			#####################################################

		}
		ELSE
		{

			#####################################################
			# 시작 => 신고_목록__없으면
			#####################################################

?>
				<tr>
					<td colspan="6" align="center"><strong>접수된 신고가 없습니다.</strong></td>
				</tr>

<?php

			#####################################################
			# 끝 => 신고_목록__없으면
			#####################################################

		}
		// 끝 => 신고_목록__유무
		//=====================================================

?>

				</tbody>
				</table>
		</div>

</section>