<?php

/*
===========================================================

	프로젝트 이름 : 피리 웹프로그램 G5

	만든사람 : 피리 PIREE

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2015년 2014년 01월 28일 화요일 오후 14시 18분 - 날씨 맑고 겨울치곤 포근한 편이다.

===========================================================
 피리 > 날짜 > 날짜 관련 라이브러리
===========================================================


*/


	#########################################################
	# 시작 => 날짜__이전_다음__년도_월__알아내기
	#########################################################
	function get__year_month__before_next($year_n, $month_n)
	{

		//=====================================================
		// 시작 => 년도__없으면
		IF (!$year_n || $year_n < 1)
		{
			$year_n = date("Y");

		}
		// 끝 => 년도__없으면
		//=====================================================


		//=====================================================
		// 시작 => 월__없으면
		IF (!$month_n || $month_n < 1)
		{
			$month_n = date("m");

		}
		// 끝 => 월__없으면
		//=====================================================


		//=====================================================
		// 이전_년도
		$date_arr["befor_year_n"] = $year_n;


		//=====================================================
		// 이전_월
		$date_arr["befor_month_n"] = $month_n;


		//=====================================================
		// 다음_년도
		$date_arr["next_year_n"] = $year_n;


		//=====================================================
		// 다음_월
		$date_arr["next_month_n"] = $month_n;


		//=====================================================
		// 시작 => 월__구분
		SWITCH ($month_n)
		{

			#####################################################
			# 시작 => 12월__이면
			CASE 1 :

				// 이전_년도
				$date_arr["befor_year_n"] = $year_n-1;

				// 이전_월
				$date_arr["befor_month_n"] = 12;

				// 다음_월
				$date_arr["next_month_n"] = 2;

			BREAK;
			# 끝 => 1월_부터_11월__이면
			#####################################################


			#####################################################
			# 시작 => 12월__이면
			CASE 12 :

				// 다음_년도
				$date_arr["next_year_n"] = $year_n+1;

				// 이전_월
				$date_arr["befor_month_n"] = 11;

				// 다음_월
				$date_arr["next_month_n"] = 1;

			BREAK;
			# 끝 => 1월_부터_11월__이면
			#####################################################


			#####################################################
			# 시작 => 1월_11월__사이_이면
			DEFAULT :

				// 이전_월
				$date_arr["befor_month_n"] = $month_n-1;

				// 다음_월
				$date_arr["next_month_n"] = $month_n+1;

			BREAK;
			# 끝 => 1월_11월__사이_이면
			#####################################################

		}
		// 끝 => 월__구분
		//=====================================================


		//=====================================================
		// 넘겨주기
		return $date_arr;

	}
	#########################################################
	# 끝 => 날짜__이전_다음__년도_월__알아내기
	#########################################################



	#########################################################
	# 시작 => 요일__한글로__바꾸기
	#########################################################
	function get__yoil_kor_s($yoil_n)
	{

		//=====================================================
		// 시작 => 요일__구분
		SWITCH ($yoil_n)
		{

			CASE 1 :			$yoil_s = "월요일";		 $yoil_span_s = "<span style=\"color:#222222\">월요일</span>";		 BREAK;
			CASE 2 :			$yoil_s = "화요일";		 $yoil_span_s = "<span style=\"color:#222222\">화요일</span>";		 BREAK;
			CASE 3 :			$yoil_s = "수요일";		 $yoil_span_s = "<span style=\"color:#222222\">수요일</span>";		 BREAK;
			CASE 4 :			$yoil_s = "목요일";		 $yoil_span_s = "<span style=\"color:#222222\">목요일</span>";		 BREAK;
			CASE 5 :			$yoil_s = "금요일";		 $yoil_span_s = "<span style=\"color:#222222\">금요일</span>";		 BREAK;
			CASE 6 :			$yoil_s = "토요일";		 $yoil_span_s = "<span style=\"color:#0000ff\">토요일</span>";		 BREAK;
			DEFAULT :		 $yoil_s = "일요일";		 $yoil_span_s = "<span style=\"color:#ff0000\">일요일</span>";		 BREAK;

		}
		// 끝 => 요일__구분
		//=====================================================


		//=====================================================
		// 요일__배열
		$yoil_arr["yoil_s"] = $yoil_s;
		$yoil_arr["yoil_span_s"] = $yoil_span_s;


		//=====================================================
		// 넘겨주기
		return $yoil_arr;

	}
	#########################################################
	# 끝 => 요일__한글로__바꾸기
	#########################################################


?>