
/*
===========================================================

	프로젝트 이름 : Piree Web Program

	만든사람 : 피리 PIREE

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2014년 12월 26일 금요일 오후 20시 52분 - 날씨 춥다

	저 작 권 : Copyright ⓒ 2014 투스포츠 (원병철) All right reserved
							그누보드 외에 추가된 소스는~
							만든사람의 허락없이 무단으로 사용할수 없습니다.
							사용하고자 할 경우 만든사람의 허락을 받아야 합니다.
							http://www.piree.co.kr 에 문의해 주세요.

===========================================================
 피리 > 피리 게시글에 투표 PLUS G5 > 자바스크립트 > 투표 등록하기
===========================================================


*/


  //#######################################################
  // 시작 => JQ
  //#######################################################
  $(function(){

  		//###################################################
  		// 날짜_선택
			$('#atvt_end_date_s').appendDtpicker({ 'locale':'ko', 'autodateOnStart':false, 'minuteInterval':10 });



  		//###################################################
  		// 시작 => 투표__사용
  		$("#wr_use_arti_vote_n").click(function() {

  		    //===============================================
  		    // 시작 => 체크__여부
  		    if($(this).is(":checked"))
  		    {

  		    		//===========================================
  		    		// 투표창__열기
  		    		$("#vote_write_form").show();

  		    }
  		    else
  		    {

  		    		//===========================================
  		    		// 투표창__닫기
  		    		$("#vote_write_form").hide();

  		    }
  		    // 끝 => 체크__여부
  		    //===============================================

  		});
  		// 끝 => 투표__사용
  		//###################################################

  });
  //#######################################################
  // 끝 => JQ
  //#######################################################




  //#######################################################
  // 시작 => 함수
  //#######################################################

	//*******************************************************
	//** PWP__760015__ARTICLE_VOTE
	//*******************************************************

  		//###################################################
  		// 시작 => 날짜__RADIO_버튼__선택
  		function choice_date(radio_date_s)
  		{

  		    //===============================================
  				// 시작 => 선택된_날짜__있으면
  				if (radio_date_s)
  				{
  						$("#atvt_end_date_Ymd").val(radio_date_s);
  				}
  				// 끝 => 선택된_날짜__있으면
  		    //===============================================

  		}
  		// 끝 => 날짜__RADIO_버튼__선택
  		//###################################################



  		//###################################################
  		// 시작 => 투표_정보__입력_확인_하기
  		function check_vote_form(gform)
  		{

  		    //===============================================
  				// 시작 => 투표__제목
					if (!gform.atvt_title_s.value || gform.atvt_title_s.value == "")
					{
							alert("\"게시글에 투표\" 하시려면 [투표 제목]을 입력해 주세요.");
							gform.atvt_title_s.focus();
							return false;
					}
  				// 끝 => 투표__제목
  		    //===============================================


/*

  		    //===============================================
  				// 시작 => 투표__마감_날짜
					if (!gform.atvt_end_date_Ymd.value || gform.atvt_end_date_Ymd.value == "")
					{
							alert("\"게시글에 투표\" 하시려면 [투표 마감 날짜]를 입력해 주세요.");
							gform.atvt_end_date_Ymd.focus();
							return false;
					}
  				// 끝 => 투표__마감_날짜
  		    //===============================================


  		    //===============================================
  				// 시작 => 투표__마감_시간
					if (!gform.atvt_end_date_H.value || gform.atvt_end_date_H.value == "")
					{
							alert("\"게시글에 투표\" 하시려면 [투표 마감 시간]를 입력해 주세요.");
							gform.atvt_end_date_H.focus();
							return false;
					}
  				// 끝 => 투표__마감_시간
  		    //===============================================


  		    //===============================================
  				// 시작 => 투표__마감_분
					if (!gform.atvt_end_date_i.value || gform.atvt_end_date_i.value == "")
					{
							alert("\"게시글에 투표\" 하시려면 [투표 마감 분]를 입력해 주세요.");
							gform.atvt_end_date_i.focus();
							return false;
					}
  				// 끝 => 투표__마감_분
  		    //===============================================


  		    //===============================================
  				// 시작 => 투표__항목_1
					if (!gform.atvt_poll_1.value || gform.atvt_poll_1.value == "")
					{
							alert("\"게시글에 투표\" 하시려면 [투표 항목 1]을 입력해 주세요.");
							gform.atvt_poll_1.focus();
							return false;
					}
  				// 끝 => 투표__항목_1
  		    //===============================================


  		    //===============================================
  				// 시작 => 투표__항목_2
					if (!gform.atvt_poll_2.value || gform.atvt_poll_2.value == "")
					{
							alert("\"게시글에 투표\" 하시려면 [투표 항목 2]를 입력해 주세요.");
							gform.atvt_poll_2.focus();
							return false;
					}
  				// 끝 => 투표__항목_2
  		    //===============================================

*/


  		    //===============================================
  				// 이상없이__통과
  				return true;

  		}
  		// 끝 => 투표_정보__입력_확인_하기
  		//###################################################

  //#######################################################
  // 끝 => 함수
  //#######################################################

