<?php

/*
===========================================================

	프로젝트 이름 : 넷테스트 급수시험

	만든사람 : 피리 PIREE

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2015년 11월 25일 수요일 오후 19시 06분 - 날씨 흐리고 살짝 쌀쌀함

===========================================================
 피리 > 피리 가입인사 게시판 스킨 > 확장 > 피리
===========================================================


*/


		#######################################################
		# 시작 => 선처리
		#######################################################

		//=====================================================
		// 개별_페이지__접근_불가
		IF (!defined('_GNUBOARD_'))										EXIT;

		#######################################################
		# 끝 => 선처리
		#######################################################






###########################################################
# 시작 => 피리__SAM
###########################################################


		#######################################################
		# 시작 => PIREE__상수
		#######################################################

		//=====================================================
		// 피리__유료__프로그램_그룹_번호
		define('G_PLUS_PROG_N', '770');


		//=====================================================
		// 피리__일반_웹_유료_프로그램__그룹_대표_번호
		define('PIREE_PROG_PLUS_MENU_N', '770001');


		//=====================================================
		// 디렉토리
		define('PIREE_DIR',								'piree');
		define('PIREE_CONFIG_DIR',				'_config');
		define('PIREE_CSS_DIR',						'_css');
		define('PIREE_JS_DIR',						'_js');
		define('PIREE_LIB_DIR',						'_lib');
		define('PIREE_IMAGE_DIR',					'_image');
		define('PIREE_SKIN_PC_DIR',				'_skin_pc');
		define('PIREE_SKIN_MOBILE_DIR', 	'_skin_mobile');
		define('PIREE_IMAGE_UPLOAD_DIR',	'IMG_UP');


		//=====================================================
		// URL
		define('PIREE_URL',							G5_URL .'/'. PIREE_DIR);
		define('PIREE_CONFIG_URL',			PIREE_URL.'/'.PIREE_CONFIG_DIR);
		define('PIREE_CSS_URL',					PIREE_URL.'/'.PIREE_CSS_DIR);
		define('PIREE_JS_URL',					PIREE_URL.'/'.PIREE_JS_DIR);
		define('PIREE_LIB_URL',					PIREE_URL.'/'.PIREE_LIB_DIR);
		define('PIREE_IMAGE_URL',				PIREE_URL.'/'.PIREE_IMAGE_DIR);
		define('PIREE_SKIN_PC_URL',			PIREE_URL.'/'.PIREE_SKIN_PC_DIR);
		define('PIREE_SKIN_MOBILE_URL',	PIREE_URL.'/'.PIREE_SKIN_MOBILE_DIR);
		define('PIREE_UP_IMAGE_URL',		G5_DATA_URL.'/'.PIREE_IMAGE_UPLOAD_DIR);


		//=====================================================
		// PATH
		define('PIREE_PATH',							G5_PATH .'/'. PIREE_DIR);
		define('PIREE_CONFIG_PATH',				PIREE_PATH.'/'.PIREE_CONFIG_DIR);
		define('PIREE_CSS_PATH',					PIREE_PATH.'/'.PIREE_CSS_DIR);
		define('PIREE_JS_PATH',						PIREE_PATH.'/'.PIREE_JS_DIR);
		define('PIREE_LIB_PATH',					PIREE_PATH.'/'.PIREE_LIB_DIR);
		define('PIREE_IMAGE_PATH',				PIREE_PATH.'/'.PIREE_IMAGE_DIR);
		define('PIREE_SKIN_PC_PATH',			PIREE_PATH.'/'.PIREE_SKIN_PC_DIR);
		define('PIREE_SKIN_MOBILE_PATH',	PIREE_PATH.'/'.PIREE_SKIN_MOBILE_DIR);
		define('PIREE_UP_IMAGE_PATH',			G5_DATA_PATH.'/'.PIREE_IMAGE_UPLOAD_DIR);


		//=====================================================
		// 현재_URL
		define('PIREE_THIS_URL',			"http://".$_SERVER["HTTP_HOST"].$_SERVER["REQUEST_URI"]);
		define('PIREE_THIS_URL_ENC',	BASE64_ENCODE(PIREE_THIS_URL));

		#######################################################
		# 끝 => PIREE__상수
		#######################################################



		#######################################################
		# 시작 => 테이블__이름
		#######################################################


		//=====================================================
		// 피리_프로그램__테이블
		$piree['program_sam'] = G5_TABLE_PREFIX.'_piree__program_sam';


		//=====================================================
		// 피리_프로그램__테이블
		$piree['program_new'] = G5_TABLE_PREFIX.'_piree__program_new';


		#######################################################
		# 끝 => 테이블__이름
		#######################################################


###########################################################
# 끝 => 피리__SAM
###########################################################






###########################################################
# 시작 => 함수
###########################################################


		#######################################################
		# 시작 => 배열에서_정보__뽑아내기
		#######################################################
		function get__array_value($arrs, $fd_name, $var_val)
		{

				//=================================================
				// 넘겨줄_값
				$get__val = 0;


				//=================================================
				// 시작 => 배열이면
				IF (is_array($arrs))
				{

						//=============================================
						// 시작 => 조건_필드__있으면
						IF ($fd_name)
						{

								//=========================================
								// 시작 => 조건_값__있으면
								IF ($var_val)
								{

										//=====================================
										// 시작 => 배열_건수__있으면
										IF (count($arrs) > 0)
										{

												//=================================
												// 시작 => 원하는_정보__가져오는_방식
												SWITCH ($fd_name)
												{

														//=============================
														// 시작 => 번호_로__이름__알아내기
														CASE "num_name" :

																WHILE (list($key, $val) = each($arrs))
																{
																	// 번호_가__같으면
																	IF ($var_val == $val['num'])				$get__val = $val["name"];
																}

														BREAK;
														// 끝 => 번호_로__이름__알아내기
														//=============================


														//=============================
														// 시작 => 번호_로__메모__알아내기
														CASE "num_memo" :

																WHILE (list($key, $val) = each($arrs))
																{
																	// 번호_가__같으면
																	IF ($var_val == $val['num'])				$get__val = $val["memo"];
																}

														BREAK;
														// 끝 => 번호_로__메모__알아내기
														//=============================


														//=============================
														// 시작 => 번호_로__코드__알아내기
														CASE "num_code" :

																WHILE (list($key, $val) = each($arrs))
																{
																	// 번호_가__같으면
																	IF ($var_val == $val['num'])				$get__val = $val["code"];
																}

														BREAK;
														// 끝 => 번호_로__코드__알아내기
														//=============================


														//=============================
														// 시작 => 코드_로__번호__알아내기
														CASE 'code_num' :

																WHILE (list($key, $val) = each($arrs))
																{
																	// 코드_가__같으면
																	IF ($var_val == $val["code"])				$get__val = $val['num'];
																}

														BREAK;
														// 끝 => 코드_로__번호__알아내기
														//=============================


														//=============================
														// 시작 => 이름_으로__번호__알아내기
														CASE "name_num" :

																WHILE (list($key, $val) = each($arrs))
																{
																	// 코드_가__같으면
																	IF ($var_val == $val["name"])				$get__val = $val['num'];
																}

														BREAK;
														// 끝 => 이름_으로__번호__알아내기
														//=============================


														//=============================
														// 시작 => 코드_로__이름__알아내기
														CASE "code_name" :

																WHILE (list($key, $val) = each($arrs))
																{
																	// 코드_가__같으면
																	IF ($var_val == $val["code"])				$get__val = $val["name"];
																}

														BREAK;
														// 끝 => 코드_로__번호__알아내기
														//=============================


														//=============================
														// 시작 => 번호_로__모두_가져오기
														CASE "num_all" :

																WHILE (list($key, $val) = each($arrs))
																{
																	// 모두 가져오기 배열에 저장
																	IF ($var_val == $val['num'])				$get__val = $val;
																}

														BREAK;
														// 끝 => 번호_로__모두_가져오기
														//=============================


														//=============================
														// 시작 => 코드로__모두_가져오기
														CASE "code_all" :

																WHILE (list($key, $val) = each($arrs))
																{
																	// 모두 가져오기 배열에 저장
																	IF ($var_val == $val["code"])				$get__val = $val;
																}

														BREAK;
														// 끝 => 코드로__모두_가져오기
														//=============================


														//=============================
														// 시작 => 이름으로__모두_가져오기
														CASE "name_all" :

																WHILE (list($key, $val) = each($arrs))
																{
																	// 모두 가져오기 배열에 저장
																	IF ($var_val == $val["name"])				$get__val = $val;
																}

														BREAK;
														// 끝 => 이름으로__모두_가져오기
														//=============================

												}
												// 끝 => 원하는_정보__가져오는_방식
												//=================================


												//=================================
												// 값__없으면
												IF (!$get__val)										 						$get__val = 0;

										}
										// 끝 => 배열_건수__있으면
										//=====================================

								}
								// 끝 => 조건_값__있으면
								//=========================================

						}
						// 끝 => 조건_필드__있으면
						//=============================================

				}
				# 끝 => 배열이면
				#################################################


				//=================================================
				// 넘겨주기
				return $get__val;

		}
		#######################################################
		# 끝 => 배열에서_정보__뽑아내기
		#######################################################



		#######################################################
		# 시작 => 디렉토리__만들기
		#######################################################
		function mkdir_chmod($dir_s)
		{

				//=================================================
				// 시작 => 1차_디렉토리__없으면__만들기
				IF ($dir_s)
				{

						//=============================================
						// 시작 => 1차_디렉토리__없으면__만들기
						IF (!is_dir($dir_s))
						{

								//=========================================
								// 디렉토리__만들기
								mkdir($dir_s, G5_DIR_PERMISSION);
								chmod($dir_s, G5_DIR_PERMISSION);

						}
						// 끝 => 1차_디렉토리__없으면__만들기
						//=============================================

				}
				// 끝 => 1차_디렉토리__없으면__만들기
				//=================================================

		}
		#######################################################
		# 끝 => 디렉토리__만들기
		#######################################################



		#######################################################
		# 시작 => 행의_첫번째_결과__가져오기
		#######################################################
		function sql_efv($sql, $error=G5_DISPLAY_SQL_ERROR, $link=null)
		{

				global $g5;

				if(!$link)
				    $link = $g5['connect_db'];

				$result = sql_query($sql, $error, $link);
				//$row = @sql_fetch_array($result) or die("<p>$sql<p>" . mysqli_errno() . " : " .  mysqli_error() . "<p>error file : $_SERVER['SCRIPT_NAME']");
				$row = sql_fetch_array($result);
				//return $row[0];
				//return $row;

				$loop_n = 0;

				$return_var = '';

				WHILE ( list($key, $val) = each($row) )
				{
						IF ( $loop_n == 0 )
						{
								$return_var = $val;
						}

						$loop_n++;
				}

				return $return_var;

		}
		#######################################################
		# 끝 => 행의_첫번째_결과__가져오기
		#######################################################



		#######################################################
		# 시작 => 쿼리_실행__결과_메세지__보여주기
		#######################################################
		function query_res($sql, $msg_s = '', $msg_echo = 'alert', $is_exit = 1)
		{

				//=================================================
				// 시작 => 쿼리_실행
				IF ( !sql_query ($sql) )
				{

						//=============================================
						// 시작 => 메세지__있으면
						IF ( $msg_echo )
						{

								//=========================================
								// 시작 => 메세지_출력__방법
								SWITCH ( $msg_s )
								{
										CASE 'echo' :						echo $msg_s;						BREAK;
										CASE 'alert' :					alert($msg_s);					BREAK;
										CASE 'return' :					return $msg_s;					BREAK;
										DEFAULT :								alert($msg_s);					BREAK;
								}
								// 끝 => 메세지_출력__방법
								//=========================================

						}
						// 끝 => 메세지__있으면
						//=============================================


						//=============================================
						// 시작 => 끝내기__이면
						IF ( $is_exit == 1 )
						{
								EXIT;
						}
						// 끝 => 끝내기__이면
						//=============================================

				}
				// 끝 => 쿼리_실행
				//=================================================

		}
		#######################################################
		# 끝 => 쿼리_실행__결과_메세지__보여주기
		#######################################################



		#######################################################
		# 시작 => 입력_폼_안내문__출력
		#######################################################
		function echo_help($help_s="")
		{
				global $g5;

				$str = "<span class='font_green'>".str_replace("\n", "<br />", $help_s)."</span>";

				echo $str;

		}
		#######################################################
		# 끝 => 입력_폼_안내문__출력
		#######################################################



		#######################################################
		# 시작 => 페이지__이동
		#######################################################
		function go_url($go_url_s, $go_time_n)
		{

				// 이동할_URL
				$go_url_s = str_replace("&amp;", "&", $go_url_s);

				// 이동_대기_시간
				IF (!$go_time_n || $go_time_n < 1)				 $go_time_n = 0;

				// 페이지__이동
				echo '<meta http-equiv="refresh" content="'.$go_time_n.';url='.$go_url_s.'" />';
				EXIT;

		}
		#######################################################
		# 끝 => 페이지__이동
		#######################################################



		#######################################################
		# 시작 => 회원권한을__SELECT_형식으로__얻음
		#######################################################
		function get_member_level_select__piree($name, $start_id=0, $end_id=10, $selected="", $event="", $disabled="")
		{

		    //=================================================
		    // 전역변수
		    global $g5;


		    //=================================================
		    // TAG_문자열
		    $str = "\n<select id=\"".$name."\" name=\"".$name."\"";


		    //=================================================
		    // 이벤트_있으면
		    IF ($event) 															$str .= " ".$event;


		    //=================================================
		    // 활성화__여부
		    IF ($disabled) 														$str .= " ".$disabled;


		    //=================================================
		    // TAG_문자열
		    $str .= ">\n";


		    //=================================================
		    // 시작 => 반복문
		    FOR ($i=$start_id; $i<=$end_id; $i++)
		    {
		        $str .= '<option value="'.$i.'"';
		        if ($i == $selected)
								$str .= ' selected="selected"';
		        $str .= ">{$i}</option>\n";
		    }
		    // 끝 => 반복문
		    //=================================================


		    //=================================================
		    // TAG_문자열__마무리
		    $str .= "</select>\n";


		    //=================================================
		    // 넘겨주기
		    return $str;

		}
		#######################################################
		# 끝 => 회원권한을__SELECT_형식으로__얻음
		#######################################################



		#######################################################
		# 시작 => 구성_디렉토리__파일__경로__알아내기
		#######################################################
		function get__sam_file($program_n, $file_s = '')
		{

				//=================================================
				// 프로그램_경로
				$program_path = "";


				//=================================================
				// 시작 => 프로그램_번호__있으면
				IF ( (int)$program_n > 0 )
				{

						//=============================================
						// 파일_이름__없으면
						IF (!$file_s || $file_s == "")				$file_s = "__config.php";


						//=============================================
						// 파일__경로
						$program_path = PIREE_PATH."/p". $program_n ."/".$file_s;

				}
				// 끝 => 프로그램_번호__있으면
				//=================================================


				//=================================================
				// 넘겨주기____프로그램_경로
				return $program_path;

		}
		#######################################################
		# 끝 => 구성_디렉토리__파일__경로__알아내기
		#######################################################



		#######################################################
		# 시작 => 디렉토리_내__파일__삭제
		#######################################################
		function delete__dir_file($dir)
		{

				IF ( $dirHandle = opendir($dir) )
				{

						chdir($dir);

						WHILE ( $file = readdir($dirHandle) )
						{

								IF ( $file == '.' || $file == '..' )				CONTINUE;

								IF ( is_dir($file) )												delete__dir_file($file);
								ELSE																				unlink($file);
      		  }

      		  chdir('..');

      		  rmdir($dir);

      		  closedir($dirHandle);

				}

		}
		#######################################################
		# 끝 => 디렉토리_내__파일__삭제
		#######################################################



		#######################################################
		# 시작 => 이미지_썸네일__삭제
		#######################################################
		function delete__thumbnail($dir, $file)
		{

			if(!$dir || !$file)
					return;

			$filename = preg_replace("/\.[^\.]+$/i", "", $file); // 확장자제거

			$files = glob($dir.'/thumb-'.$filename.'*');

			if(is_array($files)) {
					foreach($files as $thumb_file) {
							@unlink($thumb_file);
					}
			}

		}
		#######################################################
		# 끝 => 이미지_썸네일__삭제
		#######################################################


###########################################################
# 끝 => 함수
###########################################################


?>