<?php

/*
===========================================================

	프로젝트 이름 : 피리 웹프로그램

	만든사람 : 피리 PIREE

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2014년 03월 06일 목요일 오전 11시 21분, 날씨 꽃샘추위 위세가 좀 쎄다, 쌀쌀하다

	저 작 권 : Copyright ⓒ 2014-2015 투스포츠 (원병철) All right reserved
							그누보드 외에 추가된 소스는~
							만든사람의 허락없이 무단으로 사용할수 없습니다.
							사용하고자 할 경우 만든사람의 허락을 받아야 합니다.
							http://www.piree.co.kr 에 문의해 주세요.

===========================================================
 피리 > 피리 신고하기 PLUS G5 > 신고하기 폼
===========================================================


ALTER TABLE TABLE_NAME ADD `pir_report_t` tinyint(4) NOT NULL DEFAULT '0' AFTER `wr_twitter_user`
ALTER TABLE TABLE_NAME ADD `is_blind` tinyint(4) NOT NULL DEFAULT '0' AFTER `pir_report_t`


UPDATE g5_member SET pi_blind_t=0, mb_pi_report_do_t=0, mb_pi_report_get_t=0, mb_pi_report_rash_do_t=0


*/


	#########################################################
	# 시작 => 선처리
	#########################################################

	//=======================================================
	// 라이브러리__첨부
	include_once('./_common.php');


	//=======================================================
	// 시작 => 회원_여부__확인
	IF ($is_guest || !$is_member)
	{
		alert_close ("회원만 이용하실 수 있습니다");
		EXIT;
	}
	// 끝 => 회원_여부__확인
	//=======================================================

	#########################################################
	# 끝 => 선처리
	#########################################################



	#########################################################
	# 시작 => 신고하기__설정_정보_파일__첨부
	#########################################################

	//=======================================================
	// 피리_메뉴__번호
	$piree_menu_n = 770006;


	//=======================================================
	// 기본_설정_첨부__여부
	// 0 - 안해
	$is_get__piree_config = 0;


	//=======================================================
	// 신고하기__설정_정보__가져오기
	$is_get__report = 1;


	//=======================================================
	// 신고하기__설정_정보_파일__경로
	$piree_dir_path = "../_config/p__".$piree_menu_n."/pi__config.php";


	//=======================================================
	// 신고하기__설정_정보_파일__경로
	include_once($piree_dir_path);

	#########################################################
	# 끝 => 신고하기__설정_정보_파일__첨부
	#########################################################



	#########################################################
	# 시작 => 신고_권한__확인
	#########################################################

	//=======================================================
	// 시작 => 신고_권한_필드__유무
	IF (isset($member["mb_pi_report_auth"]))
	{

			#####################################################
			# 시작 => 신고_권한_필드__있으면

			//===================================================
			// 시작 => 신고_권한__없으면
			IF ($member["mb_pi_report_auth"] != 1)
			{
				alert_close ("회원님은 무분별한 신고로 신고 기능 이용을 제한합니다.");
				EXIT;
			}
			// 끝 => 신고_권한__없으면
			//===================================================
	}
	ELSE
	{

			#####################################################
			# 시작 => 신고_권한_필드__없으면

			alert_close ("사이트 기능상 지금은 신고할수 없습니다. 관리자에게 문의해 주세요.");
			EXIT;
	}
	// 끝 => 신고_권한_필드__유무
	//=======================================================


	//=======================================================
	// 시작 => 신고_권한__레벨__미달하면
	IF ($report_config["report_do_level_n"] > $member['mb_level'])
	{
		alert_close ("권한이 없습니다. 레벨 [ ".$report_config["report_do_level_n"]." ] 이상만 신고 할수 있습니다.");
		EXIT;
	}
	// 끝 => 신고_권한__레벨__미달하면
	//=======================================================

	#########################################################
	# 끝 => 신고_권한__확인
	#########################################################



	#########################################################
	# 시작 => GET_회원_번호__알아내기
	#########################################################

	//=======================================================
	// GET_회원정보
	$get_member = array();


	//=======================================================
	// 시작 => 프로그램__회원__이면
	IF ($prog_div_c == "member")
	{

		//=====================================================
		// 시작 => GET_회원_번호_없으면__알아내기
		IF (!$wr_id || $wr_id < 1)
		{

			//===================================================
			// 시작 => GET_회원_아이디__없으면__에러
			IF (!$mb_id || $mb_id == "")
			{
				// 에러
				alert_close ("필요한 회원 아이디가 전달되지 않았습니다.");

			}
			// 끝 => GET_회원_아이디__없으면__에러
			//===================================================


			//===================================================
			// GET_회원정보__알아내기
			$sql = "SELECT * FROM `".$g5['member_table']."` WHERE mb_id='".$mb_id."'";
			$get_member = sql_fetch($sql);

		}
		// 끝 => GET_회원_번호_없으면__알아내기
		//=====================================================


		//=====================================================
		// 시작 => GET_회원_번호_없으면
		IF (!$get_member["mb_no"])
		{

			//===================================================
			// 회원_가져오기
			$sql = "SELECT * FROM `".$g5['member_table']."` WHERE mb_no=".$wr_id;
			$get_member = sql_fetch($sql);

		}
		// 끝 => GET_회원_번호_없으면
		//=====================================================


		//=====================================================
		// GET_회원_번호
		$wr_id = $get_member["mb_no"];

	}
	// 끝 => 프로그램__회원__이면
	//=======================================================

	#########################################################
	# 끝 => GET_회원_번호__알아내기
	#########################################################



	#########################################################
	# 시작 => 상수__변수__배열
	#########################################################

	//=======================================================
	// 신고_대상_제목
	$report_title_s = "";


	//=======================================================
	// 신고_대상_회원
	$report_get_mem_mn	 = 0;
	$report_get_mem_id	 = "";
	$report_get_mem_nick = "";


	//=======================================================
	// 부모글_번호
	$parent_n = 0;


	//=======================================================
	// 새로_저장하는__신고_건수
	$report_now_t = 0;


	//=======================================================
	// 기존_신고_건수
	$report_old_t = 0;

	//=======================================================
	// 블라인드 이미 됬는지 여부  2016-07-07 added by Bryan Park.
	$report_is_blinded = 0;

	//=======================================================
	// 게시물|댓글|멤버 신고누적(블라)으로 인한 차단할지 안할지 여부 //2016-07-08 by Bryan Park 
	$report_comment_shutdown = 0; //마이보고에서 댓글 블라인드로 차단은 먹이지 않으니까 0으로 set.
	$report_article_shutdown = 1; 
	$report_member_shutdown = 0;
	$report_shutdown = 0; //2016-07-08 by Bryan Park - 최종적으로 해당 신고로 회원 차단할지 여부.


	//=======================================================
	// 신고_구분
	$report_prog_arr = get__report_div($prog_div_c, $bo_table);


	//=======================================================
	// 신고_구분_이름
	$report_div_s = $report_prog_arr["prog_s"];


	//=======================================================
	// 시작 => 프로그램__구분
	SWITCH ($prog_div_c)
	{

		#######################################################
		# 시작 => 게시물
		#######################################################
		CASE "article" :

			//===================================================
			// 새로_저장하는__신고_건수
			$report_now_t = $write["wr_pi_report_t"];


			//===================================================
			// 신고_건수__필드
			$report_t_fd_s = "wr_pi_report_t";


			//===================================================
			// 신고_건수__필드__쿼리문
			$sql_report_t_s = "wr_id=".$wr_id;


			//===================================================
			// 시작 => 게시물__있으면
			IF ($wr_id == $write['wr_id'])
			{

				//=================================================
				// 신고_대상_제목
				$report_title_s = stripslashes($write["wr_subject"]);


				//=================================================
				// 신고_대상_회원
				$report_get_mem_id	 = $write["mb_id"];
				$report_get_mem_nick = $write["wr_name"];


				//=================================================
				// 기존_신고_건수
				$report_old_t = $write["wr_pi_report_t"];

				//=======================================================
				// 블라인드 이미 됬는지 여부  2016-07-07 added by Bryan Park.
				$report_is_blinded = $write['wr_blind']; // 0 -> 정상 게시물 , 1 -> 블라인드 된 게시물. 2-> 관리자 레벨에서 블라인드 해제

			}
			// 끝 => 게시물__있으면
			//===================================================

		BREAK;
		#######################################################
		# 끝 => 게시물
		#######################################################



		#######################################################
		# 시작 => 댓글
		#######################################################
		CASE "comment" :

			//===================================================
			// 새로_저장하는__신고_건수
			$report_now_t = $write["wr_pi_report_t"];


			//===================================================
			// 부모글_번호
			$parent_n = $write["wr_parent"];


			//===================================================
			// 신고_건수__필드
			$report_t_fd_s = "wr_pi_report_t";


			//===================================================
			// 신고_건수__필드__쿼리문
			$sql_report_t_s = "wr_id=".$wr_id;


			//===================================================
			// 시작 => 게시물__있으면
			IF ($wr_id == $write['wr_id'])
			{

				//=================================================
				// 신고_대상_제목
				$report_title_s = stripslashes($write["wr_content"]);


				//=================================================
				// 시작 => 신고_대상_제목__글자_자르기
				IF (strlen($report_title_s) > 200)
				{
					// 글자_자르기
					$report_title_s = cut_str($report_title_s, 200);
				}
				// 끝 => 신고_대상_제목__글자_자르기
				//=================================================


				//=================================================
				// 신고_대상_회원
				$report_get_mem_id	 = $write["mb_id"];
				$report_get_mem_nick = $write["wr_name"];


				//=================================================
				// 기존_신고_건수
				$report_old_t = $write["wr_pi_report_t"];

				//=======================================================
				// 블라인드 이미 됬는지 여부  2016-07-07 added by Bryan Park.
				$report_is_blinded = $write['wr_blind']; // 0 -> 정상 게시물 , 1 -> 블라인드 된 게시물.

			}
			// 끝 => 게시물__있으면
			//===================================================

		BREAK;
		#######################################################
		# 끝 => 댓글
		#######################################################



		#######################################################
		# 시작 => 회원
		#######################################################
		CASE "member" :

			//===================================================
			// 새로_저장하는__신고_건수
			$report_now_t = $get_member["mb_pi_report_get_t"];


			//===================================================
			// 신고_건수__필드
			$report_t_fd_s = "mb_pi_report_member_t";


			//===================================================
			// 신고_건수__필드__쿼리문
			$sql_report_t_s = "mb_no=".$wr_id;


			//===================================================
			// 시작 => 회원정보__있으면
			IF ($wr_id == $get_member["mb_no"] || $mb_id == $get_member["mb_id"])
			{

				//=================================================
				// 회원_번호
				$wr_id = $get_member["mb_no"];


				//=================================================
				// 회원_번호
				$mb_id = $get_member["mb_id"];


				//=================================================
				// 신고_대상_제목
				$report_title_s	 = "이름 ".$get_member["mb_name"].", ";
				$report_title_s .= "닉네임 ".$get_member["mb_nick"].", ";
				$report_title_s .= "레벨 ".$get_member["mb_level"].", ";
				$report_title_s .= "가입일 ".substr($get_member["mb_datetime"], 0, 10);


				//=================================================
				// 신고_대상_회원
				$report_get_mem_mn	 = $get_member["mb_no"];
				$report_get_mem_id	 = $get_member["mb_id"];
				$report_get_mem_nick = $get_member["mb_nick"];


				//=================================================
				// 기존_신고_건수
				$report_old_t = $get_member["mb_pi_report_member_t"];

			}
			// 끝 => 회원정보__있으면
			//===================================================

		BREAK;
		#######################################################
		# 끝 => 회원
		#######################################################

	}
	// 끝 => 프로그램__구분
	//=======================================================

	#########################################################
	# 끝 => 상수__변수__배열
	#########################################################



	#########################################################
	# 시작 => 신고_가능__여부__확인하기
	#########################################################

	//=======================================================
	// 시작 => 신고대상__없으면
	IF (!$report_title_s)
	{
		alert_close ("신고 대상 정보가 없습니다.");
		EXIT;
	}
	// 끝 => 신고대상__없으면
	//=======================================================


	//=======================================================
	// 시작 => 블라인드_신고불가__여부
	/*IF ($report_old_t > 99 && $report_old_t < 200)
	{

		#######################################################
		# 시작 => 블라인드__이면
		alert_close ("선택하신 자료는 이미 신고 접수 되었습니다.");
		EXIT;

	}
	ELSE IF ($report_old_t > 199)
	{

		#######################################################
		# 시작 => 운영자가__신고_대상_아니라고_판단__했으면
		alert_close ("선택하신 자료는 신고 대상이 아닙니다.");
		EXIT;

	}*/ //2016-07-07 by Bryan Park - 기존 블라인드 신고불가 여부 로직 변경 -> 블라인드 이미 되있는지 아닌지 판별.
	IF($report_is_blinded==1)
	{
		#######################################################
		# 시작 => 블라인드__이면
		alert_close ("선택하신 자료는 이미 신고 접수 되었습니다.");
		EXIT;
	}
	ELSE IF($report_is_blinded==2)
	{
		#######################################################
		# 시작 => 운영자가__신고_대상_아니라고_판단__했으면
		alert_close ("선택하신 자료는 신고 대상이 아닙니다.");
		EXIT;
	}
	// 끝 => 블라인드_신고불가__여부
	//=======================================================




	#########################################################
	# 끝 => 신고_가능__여부__확인하기
	#########################################################



	#########################################################
	# 시작 => 신고_하는_DO_회원__관련
	#########################################################

	//=======================================================
	// 시작 => 신고_권한_필드__유무
	IF (isset($member["mb_pi_report_auth"]))
	{

			#####################################################
			# 시작 => 신고_권한_필드__있으면

			//===================================================
			// 시작 => 신고_권한__없으면
			IF ($member["mb_pi_report_auth"] != 1)
			{
				alert_close ("회원님은 무분별한 신고로 신고 기능 이용을 제한합니다.");
				EXIT;
			}
			// 끝 => 신고_권한__없으면
			//===================================================
	}
	ELSE
	{

			#####################################################
			# 시작 => 신고_권한_필드__없으면

			alert_close ("사이트 기능상 지금은 신고할수 없습니다. 관리자에게 문의해 주세요.");
			EXIT;
	}
	// 끝 => 신고_권한_필드__유무
	//=======================================================

	#########################################################
	# 끝 => 신고_하는_DO_회원__관련
	#########################################################



	#########################################################
	# 시작 => 신고_하는_GET_회원__정보__없으면
	#########################################################

	//=======================================================
	// 시작 => GET_회원_아이디_없으면
	IF (!$get_member["mb_id"])
	{

		//=====================================================
		// 회원_가져오기
		$sql	= "SELECT mb_no,mb_id,mb_nick,mb_level,mb_datetime ";
		$sql .= "FROM `".$g5['member_table']."` WHERE mb_id='".$report_get_mem_id."'";
		$get_member = sql_fetch($sql);

	}
	// 끝 => GET_회원_아이디_없으면
	//=======================================================


	#########################################################
	# 끝 => 신고_하는_GET_회원__정보__없으면
	#########################################################



	#########################################################
	# 시작 => 신고_하는_GET_회원__확인
	#########################################################

	//=======================================================
	// 시작 => 신고_대상_GET_회원__레벨__면제_여부__확인
	IF ($get_member["mb_level"] > $report_config["exemption_level_n"])
	{
		alert_close ("회원 레벨 [ ".$report_config["exemption_level_n"]." ] 이상인 회원을 신고할수 없습니다.");
		EXIT;
	}
	// 끝 => 신고_대상_GET_회원__레벨__면제_여부__확인
	//=======================================================


	//=======================================================
	// 시작 => 신고_면제하는__회원_가입_경과_일수__있으면
	IF ($report_config["exemption_day_n"] > 0)
	{

		//=====================================================
		// 회원_가입일시_초
		$report_get_join_time_n = strtotime($get_member["mb_datetime"]);


		//=====================================================
		// 시작 => 신고_대상_GET_회원__가입일__면제_여부__확인
		IF ((floor((G5_SERVER_TIME-$report_get_join_time_n)/86400)) >= $report_config["exemption_day_n"])
		{
			alert_close ("가입후 [ ".$report_config["exemption_day_n"]." ] 일이 지난 회원을 신고할수 없습니다.");
			EXIT;
		}
		// 끝 => 신고_대상_GET_회원__가입일__면제_여부__확인
		//=====================================================

	}
	// 끝 => 신고_면제하는__회원_가입_경과_일수__있으면
	//=======================================================

	#########################################################
	# 끝 => 신고_하는_GET_회원__확인
	#########################################################



	#########################################################
	# 시작 => 상수__변수__배열
	#########################################################

	//=======================================================
	// 돌아갈__페이지
	$report_url_s = "do.pop.php?prog_div_c=".$prog_div_c."&amp;bo_table=".$bo_table."&amp;".$sql_report_t_s;

	#########################################################
	# 끝 => 상수__변수__배열
	#########################################################



	#########################################################
	# 시작 => 신고_사유__불러오기
	#########################################################

	//=======================================================
	// 신고_사유__건수__확인하기
	$sql	 = "SELECT COUNT(*) FROM `".$piree_table['report_reason']."` WHERE ".$report_prog_arr["fd_s"]."=1";
	$total = sql_efv($sql);


	//=======================================================
	// 시작 => 신고_사유__있으면
	IF ($total > 0)
	{

		//=====================================================
		// 신고_사유__불러오기
		$sql		= "SELECT num,subject_s ";
		$sql	 .= "FROM `".$piree_table['report_reason']."` WHERE ".$report_prog_arr["fd_s"]."=1 ORDER BY order_n ASC";
		$result = sql_query ($sql);

	}
	// 끝 => 신고_사유__있으면
	//=======================================================

	#########################################################
	# 끝 => 신고_사유__불러오기
	#########################################################








###########################################################
# 시작 => 신고하기__실시
###########################################################

	//=======================================================
	// 시작 => 신고하기
	IF ($mode == "report_do")
	{

		#######################################################
		# 시작 => 필수입력___확인
		#######################################################

		//=====================================================
		// 신고_사유
		IF (!$reason_n)															$reason_n = 0;


		//=====================================================
		// 시작 => 신고_사유__선택되지_않았으면
		IF (!$reason_n || $reason_n == "")
		{

			//===================================================
			// 시작 => 신고_메모__입력되지_않았으면
			IF (!$report_memo_s || $report_memo_s == "")
			{

				// 에러
				alert ("신고 사유나 메모중 하나를 선택, 입력해 주세요.", "");
				EXIT;

			}
			// 끝 => 신고_메모__입력되지_않았으면
			//===================================================

		}
		// 끝 => 신고_사유__선택되지_않았으면
		//=====================================================

		#######################################################
		# 끝 => 필수입력___확인
		#######################################################



		#######################################################
		# 시작 => 동일_회원__중복_신고__확인
		#######################################################

		//=====================================================
		// 결과
		$resu_s__rash = "무분별한 신고";
		$resu_s__clrear = "조치없이 완료";


		//=====================================================
		// 동일_회원__중복_신고__확인하기
		$sql	 = "SELECT COUNT(*) FROM `".$piree_table['report_list']."` ";
		$sql	.= "WHERE do_mem_mn=".$member['mb_no']." AND ";
		$sql	.= "prog_div_c='".$prog_div_c."' AND ";
		$sql	.= "bo_table='".$bo_table."' AND ";
		$sql	.= "arti_n=".$wr_id." AND ";
		$sql	.= "resu_s<>'".$resu_s__rash."' AND ";
		$sql	.= "resu_s<>'".$resu_s__clrear."'";
		$total = sql_efv($sql);


		//=====================================================
		// 시작 => 이미__신고_했으면
		IF ($total > 0)
		{

			// 에러
			alert_close ("이미 신고 하셨습니다.");
			EXIT;

		}
		// 끝 => 이미__신고_했으면
		//=====================================================

		#######################################################
		# 끝 => 동일_회원__중복_신고__확인
		#######################################################



		#######################################################
		# 시작 => 신고_받는__회원_번호__없으면
		#######################################################

		//=====================================================
		// 시작 => 신고_받는__회원_번호__없으면
		IF (!$report_get_mem_mn || $report_get_mem_mn == 0)
		{

			//===================================================
			// 회원_가져오기
			$sql = "SELECT mb_no FROM `".$g5['member_table']."` WHERE mb_id='".$report_get_mem_id."'";
			$report_get_mem_mn = sql_efv($sql);

		}
		// 끝 => 신고_받는__회원_번호__없으면
		//=====================================================

		#######################################################
		# 끝 => 신고_받는__회원_번호__없으면
		#######################################################



		#######################################################
		# 시작 => 신고하기
		#######################################################

		//=====================================================
		// 저장하는__쿼리문
		$sql	= "INSERT INTO `".$piree_table['report_list']."` SET ";
		$sql .= "do_mem_mn=".$member['mb_no'].", ";
		$sql .= "do_mem_id='".$_SESSION['ss_mb_id']."', ";
		$sql .= "do_mem_nick='".$member['mb_nick']."', ";
		$sql .= "get_mem_mn=".$report_get_mem_mn.", ";
		$sql .= "get_mem_id='".$report_get_mem_id."', ";
		$sql .= "get_mem_nick='".$report_get_mem_nick."', ";
		$sql .= "prog_div_c='".$prog_div_c."', ";
		$sql .= "bo_table='".$bo_table."', ";
		$sql .= "arti_n=".$wr_id.", ";
		$sql .= "parent_n=".$parent_n.", ";
		$sql .= "reason_n=".$reason_n.", ";
		$sql .= "title_s='".$report_title_s."', ";
		$sql .= "report_memo_s='".$report_memo_s."', ";
		$sql .= "active_s='접수', ";
		$sql .= "do_ip_s='".$_SERVER["REMOTE_ADDR"]."', ";
		$sql .= "regi_time_n=".G5_SERVER_TIME;


		//=====================================================
		// 시작 => 입력하기
		IF ( !sql_query ($sql) )
		{

			// 메세지
			$msg_in_s = "[ 신고 ] 를 접수하지 못했습니다.";

			// 에러
			alert_close ($msg_in_s);
			EXIT;

		}
		$rp_num = sql_insert_id();// 2016-07-12 방금 insert 한 row의 id값 추출. => black_list 테이블의 rp_num 컬럼에 넣기. by Bryan Park
		// 끝 => 입력하기
		//=====================================================

		#######################################################
		# 끝 => 신고하기
		#######################################################



		#######################################################
		# 시작 => 블라인드__처리하기
		#######################################################

		//=====================================================
		// 새로_저장하는__신고_건수
		$report_now_t++;

		//=====================================================
		// 1 -> 블라인드를 먹임. 0 -> 블라인드 먹이지 않음. //2016-07-07 by Bryan Park - 추가.
		$report_set_blind = 0;


		//=====================================================
		// 신고_처리_동작
		$report_sql_s = "신고";


		//=====================================================
		// 시작 => 신고_건수__0이상_100이하__이면
		//IF ($report_now_t > 0 && $report_now_t < 100) //2016-07-07 by Bryan Park <- 수정. 신고건수 0이상이면으로
		IF($report_now_t > 0)
		{

			//===================================================
			// 블라인드__처리할__신고_건수
			$blind_do_t = $report_config["blind_do_t"];


			//===================================================
			// 시작 => 블라인드__해당되면
			IF ($report_now_t >= $blind_do_t)
			{

				###################################################
				# 시작 => 블라인드__처리
				###################################################

				//=================================================
				// 신고_처리_동작
				$report_sql_s = "블라인드";

				//=================================================
				// 블라인드__처리
				//$report_now_t += 100; //2016-07-07 by Bryan Park 주석처리 그리고 블라인드되게끔.
				$report_set_blind = 1;

				###################################################
				# 끝 => 블라인드__처리
				###################################################

			}
			// 끝 => 블라인드__해당되면
			//===================================================

		}
		// 끝 => 신고_건수__0이상_100이하__이면 //2016-07-07 by Bryan Park => 0 이상이면.
		//=====================================================

		#######################################################
		# 끝 => 블라인드__처리하기
		#######################################################



		#######################################################
		# 시작 => 자료_신고__처리하기
		#######################################################

		//=====================================================
		// 게시물_신고__증가하는__쿼리
		$sql	= "UPDATE `".$report_prog_arr["arti_table"]."` SET ";
		$sql .= $report_t_fd_s."=".$report_now_t." ";
		//2016-07-07 by Bryan Park - 추가 -> $report_set_blind == 1 일때 함께 wr_blind = 1로 업데이트 시켜주게끔 쿼리문 추가.
		if($report_set_blind ==1) $sql .= ", `wr_blind` =".$report_set_blind." "; //2016-07-07 by Bryan Park 
		$sql .= "WHERE ".$sql_report_t_s;

		//=====================================================
		// 시작 => 쿼리_실행
		IF ( !sql_query ($sql) )
		{

			// 에러_메세지
			$save_err_msg = "선택하신 [ ".$report_div_s." ] 를 [ ".$report_sql_s." ] 하지 못했습니다.";

			// 에러
			alert_close ($save_err_msg);
			EXIT;

		}
		// 끝 => 쿼리_실행
		//=====================================================

		#######################################################
		# 끝 => 자료_신고__처리하기
		#######################################################



		#######################################################
		# 시작 => GET_회원__신고_건수__증가하기
		#######################################################

		//=====================================================
		// 시작 => 신고_상태__블라인드_아니면
		//IF ($report_now_t < 100) //2016-07-07 by Bryan Park - 블라인드를 먹일지 여부를 결정하는 변수 $report_set_blind를 사용하도록
		IF ($report_set_blind == 0)
		{

			//===================================================
			// GET_회원_신고__증가하는__쿼리
			$sql	= "UPDATE `".$g5['member_table']."` SET ";
			$sql .= "mb_pi_report_get_t=mb_pi_report_get_t+1 ";
			$sql .= "WHERE mb_no=".$report_get_mem_mn;


			//===================================================
			// 시작 => 쿼리_실행
			IF ( !sql_query ($sql) )
			{

				// 에러_메세지
				$save_err_msg = "GET 회원 신고하기 수치 정보를 저장하지 못했습니다.";

				// 에러
				alert_close ($save_err_msg);
				EXIT;

			}
			// 끝 => 쿼리_실행
			//===================================================

		}
		// 끝 => 신고_상태__블라인드_아니면
		//=====================================================

		#######################################################
		# 끝 => GET_회원__신고_건수__증가하기
		#######################################################


		#######################################################
		# 시작 => GET_회원__블라인드_건수__증가하기 //2016-07-07 by Bryan Park  - 추가 -> 해당 회원이 블라인드 받은 건수를 증가시킴.
		#######################################################
		IF ($report_set_blind == 1) //현재 처리가 블라인드 처리일때. -> 1) 해당 작성자 블랙, 2)블라인드 게시물 테이블에 게시물 정보 저장.
		{

			$blackListTB = "g5__piree_770006_black_list"; //2016-07-07 by Bryan Park - 신고/차단 회원 테이블.
			
			$mb_info = sql_fetch("SELECT * FROM `".$g5['member_table']."` WHERE mb_id='".$report_get_mem_id."'"); //2016-07-07 by Bryan Park - 신고 당한 회원정보.

			$block_sql = ""; //2016-07-07 by Bryan Park - 블랙리스트 테이블에 회원정보 + "게시물:게시판"(사유)을 넣게 위한 쿼리문. 
			//===================================================
			////2016-07-07 by Bryan Park - 블라인드 몇 회 당했는지 정보를 가져온다 
			$blind_get_count = $mb_info['mb_pi_blind_t'];
			
			//2016-07-07 by Bryan Park - 추가 - 블랙리스트 테이블에 정보 입력 - bl_active 는 기존의 isCheck
			$block_sql = "INSERT INTO ".$blackListTB." (mb_id, mb_ip, rp_num, prog_div_c, bo_table, wr_id, bl_comment, bl_type, bl_active, regdate) "; // regdate는 default NOW()로 설정되어있다.
			//2016-07-28 블라인드된 게시물 목록 테이블에 insert 하기 위한 query가 필요하다. by Bryan Park
			
			$block_sql .= " VALUES (";
			$block_sql .= "'".$mb_info['mb_id']."', ";
			$block_sql .= "'".$mb_info['mb_ip']."', "; 
			$block_sql .= "'".$rp_num."', ";// 2016-07-12 report_list 테이블에 insert 후 sql_insert_id()함수로 가져온 num값. by Bryan Park
			
			SWITCH($prog_div_c){ //2016-07-08 by Bryan Park - 추가 - 게시물 신고, 댓글 신고, 회원 신고에 따라서 다른 커맨트를 입력하게끔.[bl_comment]
				CASE "article"://2016-07-08 by Bryan Park => 블랙리스트 사유는 - 게시판 명 : 게시물 제목 형식으로 이뤄진다 
					$block_sql .= "'".$prog_div_c."', ";// 2016-07-12 prog_div_c[신고 대상 분류] by Bryan Park
					$block_sql .= "'".$bo_table."', ";// 2016-07-12 신고 대상 게시물이 속한 board by Bryan Park
					$block_sql .= "'".$wr_id."', ";// 2016-07-12 신고 대상 게시물의 wr_id by Bryan Park
					$board_subject = $board['bo_subject'];
					$block_sql .= "'".$board_subject.":".$report_title_s."', "; //블랙 사유 bl_comment -> 보드테이블명, 게시물제목.
					if($report_article_shutdown) $report_shutdown = 1;//2016-07-08 by Bryan Park - 게시물 신고누적(블라)로 인한 차단 허용시 -> 차단 실행 허용.
					break;
				CASE "comment"://2016-07-08 by Bryan Park 댓글의 경우엔 내용으로 출력.
					$block_sql .= "'".$prog_div_c."', ";// 2016-07-12 prog_div_c[신고 대상 분류] by Bryan Park
					$block_sql .= "'".$bo_table."', ";// 2016-07-12 신고 대상 게시물이 속한 board by Bryan Park
					$block_sql .= "'".$wr_id."', ";// 2016-07-12 신고 대상 게시물의 wr_id by Bryan Park
					$board_subject = $board['bo_subject'];
					$block_sql .= "'[댓]".$board_subject.":".$report_title_s."', "; //블랙 사유 bl_comment
					if($report_comment_shutdown) $report_shutdown = 1;
					break;
				CASE "member":
					$block_sql = "'".$prog_div_c."', ";// 2016-07-12 prog_div_c[신고 대상 분류] by Bryan Park
					$block_sql .= "'', ";// 2016-07-12 신고 대상 게시물이 속한 board by Bryan Park
					$block_sql .= "0, ";// 2016-07-12 신고 대상 게시물의 wr_id by Bryan Park
					$block_sql .= "'회원 신고로 인한 차단', "; //블랙 사유 bl_comment
					if($report_member_shutdown) $report_shutdown = 1;
					break;				
			}
			
			//2016-07-07 by Bryan Park  - 최초 차단이거나 이번 차단 포함 5회 미만인 경우에는 일시 차단 시킨다. 
			IF ($blind_get_count < 4){ 
				$block_sql .= "'T', "; //타입.
			}
			ELSE {//2016-07-07 by Bryan Park  - 블라인드 횟수가 이미 4회 이상 누적 되있었다면 -> +1 하면 5회 이상이 됨으로 해당 회원을 영구 차단시킨다.
				$block_sql .= "'P', ";
			}
			$block_sql .= "'Y', "; //bl_active - 기존의 isCheck.
			$block_sql .= "NOW()"; //regdate를 현시간으로.
			$block_sql .=")";
			//2016-07-07 by Bryan Park - 주석 -> P로 차단 당한 사람이 재차 블라인드 먹으면 또 P로 차단당함.
			
			if($report_shutdown){//2016-07-08 by Bryan Park - 회원 차단 실행
				//2016-07-07 by Bryan Park  - 완성된 쿼리로 블랙리스트 테이블에 회원정보를 삽입, 에러시 에러 반환.
				if(!sql_query($block_sql)){
					// 에러_메세지//2016-07-08 by Bryan Park 
					$save_err_msg = $prog_div_c."블라인드 및 회원 차단을 적용하지 못했습니다.";

					// 에러
					alert_close ($save_err_msg);
					EXIT;
				}
			}
			//===================================================
			


			###########################################################
			# 시작 => 2016-07-28 블라인드된 게시물 목록 테이블에 저장 by Bryan Park
			###########################################################
			//함수 정의는 piree/_config/p770006/pi__config.php 에 저장;
			add__blinded_list();

			###########################################################
			# 끝 => 2016-07-28 블라인드된 게시물 목록 테이블에 저장 by Bryan Park
			###########################################################

			//===================================================
			// GET_회원_신고__증가하는__쿼리 ////2016-07-07 by Bryan Park  -> 추가 -> 해당 회원이 신고 받은 횟수를 증가시킴.
			$sql	= "UPDATE `".$g5['member_table']."` SET ";
			$sql .= "mb_pi_report_get_t=mb_pi_report_get_t+1 ";
			
			//===================================================
			// 해당 회원의 게시물이 블라인드 대상임으로 블라인드 카운트도 +1 한다.
			$sql .= ", mb_pi_blind_t = mb_pi_blind_t + 1 ";
			// //2016-07-07 by Bryan Park  상단에서 정의한 업데이트 문 마지막 WHERE 절 붙여넣기 - 위에서 -> 블라인드 카운트 증가 | 차단 목록 삽입 쿼리도 함께 붙인다.
			$sql .= "WHERE mb_no=".$report_get_mem_mn;

			//===================================================
			// 시작 => 쿼리_실행
			IF ( !sql_query ($sql) )
			{

				// 에러_메세지
				$save_err_msg = "GET 회원 신고하기 수치 정보를 저장하지 못했습니다.";

				// 에러
				alert_close ($save_err_msg);
				EXIT;

			}
			// 끝 => 쿼리_실행
			//===================================================
			
		}
		
		#######################################################
		# 끝 => GET_회원__블라인드_건수__증가하기
		#######################################################

		#######################################################
		# 시작 => DO_회원__신고_건수__증가하기
		#######################################################

		//=====================================================
		// DO_회원_신고__증가하는__쿼리
		$sql	= "UPDATE `".$g5['member_table']."` SET ";
		$sql .= "mb_pi_report_do_t=mb_pi_report_do_t+1 ";
		$sql .= "WHERE mb_no=".$member['mb_no'];


		//=====================================================
		// 시작 => 쿼리_실행
		IF ( !sql_query ($sql) )
		{

			// 에러_메세지
			$save_err_msg = "DO 회원 신고하기 수치 정보를 저장하지 못했습니다.";

			// 에러
			alert_close ($save_err_msg);
			EXIT;

		}
		// 끝 => 쿼리_실행
		//=====================================================

		#######################################################
		# 끝 => DO_회원__신고_건수__증가하기
		#######################################################



		#######################################################
		# 시작 => GET_회원__포인트__거래하기
		#######################################################

		//=====================================================
		// 시작 => 신고__GET_회원__포인트__있으면
		IF ($report_config["report_get_point_n"])
		{

			//===================================================
			// 포인트_거래__사유
			$point_trade_s = $report_prog_arr["prog_s"]." 신고 받음 (GET)";


			//===================================================
			// 포인트__거래
			insert_point($report_get_mem_id, $report_config["report_get_point_n"], $point_trade_s, $bo_table, $wr_id, '신고');

		}
		// 끝 => 신고__GET_회원__포인트__있으면
		//=====================================================

		#######################################################
		# 끝 => GET_회원__포인트__거래하기
		#######################################################



		#######################################################
		# 시작 => DO_회원__포인트__거래하기
		#######################################################

		//=====================================================
		// 시작 => 신고__DO_회원__포인트__있으면
		IF ($report_config["report_do_point_n"])
		{

			//===================================================
			// 포인트_거래__사유
			$point_trade_s = $report_prog_arr["prog_s"]." 신고 했음 (DO)";


			//===================================================
			// 포인트__거래
			insert_point($_SESSION['ss_mb_id'], $report_config["report_do_point_n"], $point_trade_s, $bo_table, $wr_id, '신고');

		}
		// 끝 => 신고__DO_회원__포인트__있으면
		//=====================================================

		#######################################################
		# 끝 => DO_회원__포인트__거래하기
		#######################################################



		#######################################################
		# 시작 => 게시물_수_댓글_수__새로고침
		#######################################################

		//=====================================================
		// 게시물_수_댓글_수__새로고침
		// realod_row_count($prog_div_c, $bo_table, $wr_id);

		#######################################################
		# 끝 => 게시물_댓글_수__새로고침_하기
		#######################################################



		#######################################################
		# 시작 => 마무리
		#######################################################

		//=====================================================
		// 성공__알림
		//alert_close("정상적으로 신고하였습니다.");
		////2016-07-07 by Bryan Park - 추가 블라인드시 확인
		$alert_close_message = "";
		if($report_set_blind == 1){
			$alert_close_message = "신고를 통해 블라인드 처리되었습니다.";
		}
		else{
			$alert_close_message = "정상적으로 신고하였습니다.";
		}
		alert_close($alert_close_message);


		//=====================================================
		// 끝
		EXIT;

		#######################################################
		# 끝 => 마무리
		#######################################################

	}
	// 끝 => 신고하기
	//=======================================================

###########################################################
# 끝 => 신고하기__실시
###########################################################








	#########################################################
	# 시작 => 마무리__페이지_ECHO_관련
	#########################################################

	//=======================================================
	// 타이틀
	$g5['title'] = "피리 신고하기 PLUS G5";


	//=======================================================
	// HEAD_첨부
	include_once(G5_PATH.'/head.sub.php');


	//=======================================================
	// 시작 => DEVIDE__구분
	IF (G5_IS_MOBILE == 1)
	{

		#######################################################
		# 시작 => DEVIDE__모바일__이름

		//=====================================================
		// 스킨__PATH
		$skin_path_s = $report_config["skin_mobile_p"]."/pi__do.pop.php";

	}
	ELSE
	{

		#######################################################
		# 시작 => DEVIDE__PC__이면

		//=====================================================
		// 스킨__PATH
		$skin_path_s = $report_config['skin_pc_p']."/pi__do.pop.php";

	}
	// 끝 => DEVIDE__구분
	//=======================================================


	//=======================================================
	// BOTTOM_첨부
	include_once($skin_path_s);


	//=======================================================
	// BOTTOM_첨부
	include_once(G5_PATH.'/tail.sub.php');

	#########################################################
	# 끝 => 마무리__페이지_ECHO_관련
	#########################################################


?>
