<?php

	#########################################################
	# 시작 => 선_처리__메뉴_지정__관리자_확인
	#########################################################

	//=======================================================
	// 기본처리_파일__첨부
	include_once('./_common.php');


	//=======================================================
	// 관리자_확인
	auth_check($auth[$sub_menu], 'r');


	//=======================================================
	// 시작 => 운영자__확인
	IF (!$is_admin)
	{
			alert ("권한이 없습니다.", G5_DOMAIN.'/');
		EXIT;
	}
	// 끝 => 운영자__확인
	//=======================================================

	#########################################################
	# 끝 => 선_처리__메뉴_지정__관리자_확인
	#########################################################



	#########################################################
	# 시작 => 저장하기
	#########################################################

	//=======================================================
	// 순서
	$loop_n = (int)$loop_n;


	//=======================================================
	// 시작 => 순서__기본값
	IF ($loop_n < 2)
	{
			$loop_n = 2;
	}
	// 끝 => 순서__기본값
	//=======================================================


	//=======================================================
	// 시작 => 1000번_넘으면
	IF ($loop_n > 1000)
	{

			//===================================================
			// 이동할__페이지
			$go_url_s = "../";


			//===================================================
			// 에러
			echo "<meta http-equiv='refresh' content='0;url=".$go_url_s."' />";
			EXIT;

	}
	// 끝 => 1000번_넘으면
	//=======================================================


	//=======================================================
	// 아이디_배열
	$id_arr = array("111", "119bike", "119바이크", "123", "1234", "12345", "123456", "1234567", "12345678", "123456789", "1234567890", "1박2일", "1호선", "2AM", "2000", "2002", "2012", "2013", "2015", "2016", "2017", "2018", "2019", "2020", "2077", "20000", "2NE1", "2PM", "2am", "2pm", "2에이엠", "2피엠", "2호선", "3002bike", "3호선", "4호선", "5호선", "6호선", "77", "715782", "7호선", "8호선", "9호선", "Armstrong", "Athens", "BLUERIDER", "BMX", "Blue", "BlueRmem_ider", "Cappuccino", "ELEVEN", "ELFAMA", "FORCE", "FTM", "Greece", "IOS", "IPAD", "IPHONE", "JAKROO", "KARA", "LOVERIOUS", "Laser", "MANIA", "MCN", "OTL", "OVERPACE", "PIREE", "POTATO", "ReBirth", "SCODY", "STRIDA", "WORLDBYCYCLE", "about", "aden", "adenbike", "adenbikewear", "admem_idas", "admin", "aeni", "aeni84", "aerospace", "ahnsports", "alton", "altonshop", "altonsports", "america", "amstrong", "animal", "apple", "armstrong", "athatb", "bigsher", "bike119", "bikeart", "bikecity", "bikemania", "bikesell", "biketraveler", "bikezone", "black", "blackcat", "blockb", "bluermem_ider", "bluesky", "boeing", "cadenza", "camel", "camelbak", "cannondale", "cappuccino", "cateye", "cefas", "cello", "cellobike", "cellomtb", "chnr0516", "corea", "corex", "costco", "costcobicycle", "costcobike", "costcomtb", "cskyblue83", "dahon", "daum", "deux", "downhill", "downtown", "eagle", "eleven", "elfama", "eocjf87", "extra", "falcon", "feelmorys", "freeagent", "freermem_ider", "freeriding", "freestyle", "g-드래곤", "gallexy", "gallexynote", "gallexys", "gallexys2", "gallexys3", "gallexy노트", "garyfisher", "gdragon", "ghdi80", "giant", "girlsgeneration", "greece", "g드래곤", "hmasngel", "htc", "hummer", "hymtb", "hyundai", "iguana", "ios", "ipad", "ipad10", "ipad11", "ipad12", "ipad2", "ipad2mini", "ipad3", "ipad3lte", "ipad3mini", "ipad3wibro", "ipad3wimax", "ipad4", "ipad5", "ipad6", "ipad7", "ipad8", "ipad9", "iphone", "iphone10", "iphone11", "iphone12", "iphone3", "iphone3gs", "iphone4", "iphone4gs", "iphone4s", "iphone5", "iphone5lte", "iphone5s", "iphone5slte", "iphone5wibro", "iphone5wimax", "iphone6", "iphone6lte", "iphone6s", "iphone6slte", "iphone6wibro", "iphone6wimax", "iphone7", "iphone8", "iphone9", "italia", "italy", "itx", "itx청춘", "jamis", "jeju", "jejubike", "jihwaja772", "kbs", "kcnc", "korea", "koreabike", "koreacycle", "ktx", "ktx산천", "lespo", "litespeed", "mania", "marin", "marlin", "mbc", "mega", "megaglass", "megalight", "megalite", "mermem_ida", "merlin", "mildbike", "minivelomania", "mirinae", "missA", "missa", "mtbland", "mtb_mania", "mtbrmem_ider", "mymtb", "myway", "najochi", "naver", "nefa", "nepa", "nian", "nike", "nina", "northface", "ortlieb", "overpace", "park115522", "photo", "phototour", "pio", "piree", "pireeadmin", "pireebike", "pireeman", "plus", "potato", "qamm", "redface", "reebok", "reflex", "rmem_ider", "rlaemrrl", "roadstar", "roma", "root", "samsung", "sbs", "scafel", "scale", "scott", "scottusa", "sd20906", "sefas", "sellbike", "selle", "semi", "seoul", "shimano", "shinee", "silence", "sky", "smp", "space", "spbike", "specialrized", "spmtb", "susemi", "susemi99", "tassajara", "thenorthface", "theredface", "thisbike", "timberline", "tobike", "tomcat", "top", "topeak", "tosports", "tour", "trek", "uphill", "wavebikes", "webmaster", "weisure", "wellgo", "wheeler", "wibro", "wildbike", "wimax", "wjdrudfk", "woj85", "wow7558", "xkznal84", "xtr", "yahoo", "youjinbike", "youtube", "가람", "감자", "강대성", "강릉원주선", "강원도", "강원선", "강호동", "개굴소녀", "개굴아재", "갤럭시", "갤럭시note", "갤럭시s", "갤럭시s2", "갤럭시s3", "갤럭시노트", "거북이", "검둥이", "검룡소", "검은감자", "검은아이", "게리피셔", "경부선", "경북선", "경의선", "경인선", "경전선", "경포대", "고구려", "고구마", "고려", "고산자", "고속철도", "고조선", "고현정", "골든레이디", "공민지", "공싸이클", "공항철도", "운영자", "관악산", "광대곡", "광덕산", "괴롭히셔", "구문소", "구미정", "구엔키", "구자명", "구절리", "구절리역", "구하라", "권도영", "권유리", "권지용", "그리스", "그리움", "금천MTB", "기성용", "김광석", "김기범", "김남길", "김명기", "김삿갓", "김정호", "김중호", "김태연", "까페라떼", "꿈에", "나그네", "나는승시", "나는야쏭", "나르샤", "나무그늘", "나무자전거", "나쁜후니", "나영석", "나의노래", "나이키", "남대문", "남한강", "남한산성", "내마음속의미니벨로", "냉동공조", "네이버", "네이버까페", "네이버카페", "네이트", "네파", "네파는자유다", "네팔청년", "노란돌고래", "노무현", "노스페이스", "노원구", "노철웅", "니나", "다람쥐", "다섯자", "다운힐", "다운힐러", "다원어패럴", "다음", "다이나믹듀오", "다크에덴", "대관령", "대도자전거", "대성", "대통령", "대한민국", "더노스페이스", "더레드페이스", "덕만이", "덕산기", "덕산기계곡", "도로사이클", "도로싸이클", "도싸", "도이터", "돌아온일지매", "동그라미", "동대문", "동방신기", "동영배", "두문동", "두문동재", "듀스", "디아도라", "딸기냉면", "땅꾼", "뚝샘", "뜨거운감자", "라디오스타", "라이트매니아", "란에보", "란정이", "레드페이스", "레일바이크", "레포츠", "로로스", "로마", "로모티브", "루트마스터", "리버스", "리버스바이크", "리복", "리즈", "마세비", "마스터", "마운틴하트", "마이웨이", "마일리지", "만항재", "망우산", "매니아", "매봉산", "매직아이", "맨체스터", "맨체스터utd", "맨체스터유나이티드", "메가글래스", "메가라이트", "메가바이크", "메니아", "메드인", "메뚜기", "멕시코", "명기", "모노로그", "몰운대", "무궁화", "무궁화호", "무명", "무색", "무한질주", "문화방송", "뮤직", "미니미니", "미니벨로", "미니벨로매니아", "미니벨로이야기", "미래소년", "미래소년코난", "미르", "미리내", "미스에이", "미시령", "미쓰에이", "민둥산", "민지", "민호", "민호", "바람", "바셀", "바이시클", "바이크나라", "바이크데이", "바이크라이더", "바이크랜드", "바이크로드", "바이크마트", "바이크매거진", "바이크매니아", "바이크샵", "바이크셀", "바이크아울렛", "바이크장터", "바이크존", "바이크코드", "바이크트레이드", "바이키", "바이키쇼핑", "바티칸", "박성호", "박주영", "박지빈", "박지성", "박찬호", "밤푸스", "방랑시인", "백두산", "백복령", "백제", "버뮤다", "벌문재", "법흥사", "베르바토프", "벨라전기자전거", "변재원", "별마로", "별마로천문대", "병철이", "보잉", "봉래산", "부여", "북한산", "분당선", "불암산", "불탄감자", "브라운아이드걸스", "브레끼", "블락비", "블랙", "블루라이더", "블루라이딩", "블루스카이", "비갠", "비갠날", "비갠날씨", "비갠아침", "비갠오전", "비갠오후", "비갠하늘", "비단강", "비담", "비올까", "비행기", "빅뱅", "빅셔", "뼈시큰쏭", "뽀빠이", "뿌잉뿌잉", "사각형", "사랑", "사랑니", "사시장춘", "사이", "사이클", "사일런스", "사자", "산드라박", "산들로", "산들로자전거", "산마루", "산바다스포츠", "산악자전거", "산초", "삽당령", "상오기", "새마을", "새마을호", "샤라", "샤이니", "샤이닝", "서강", "서울", "서울방송", "서울시장", "서울시청", "서울특별시", "서태지", "서현", "선돌", "선샤인", "선암마을", "선재", "설악산", "성깔", "성남여주선", "성내샵", "성유리", "성훈", "세계자전거여행", "세모", "세븐사이클", "세종", "세종대왕", "세컨윈드", "세파스", "션샤인", "소녀", "소녀시대", "소년", "소시", "소주일잔", "속리산", "속초", "송천", "송파", "송파MTB", "송파삼천리", "송파자전거", "송파코렉스", "쇼핑몰", "수세미", "수영", "수원", "수인선", "순규", "숭례문", "슈렉", "슈퍼맨", "스카이", "스캇코리아", "스코디", "스텝", "스트라이다", "스팟", "스페셜라이즈드", "스페이스", "스펠바운드", "스피드자전거", "슨갱", "승기", "승리", "승리", "승호", "시마노", "신라", "신분당선", "신승훈", "실버곰팅", "싸랑니", "싸이", "싸이월드", "싼초", "써니", "써니행님", "썬샤인", "쎄미", "씨엘", "아덴", "아덴바이크", "아덴바이크웨어", "아디다스", "아름다운자전거", "아마추어자전거여행동호회", "아빠나만원만", "아우라지", "아이", "아이마이", "아이자전거", "아이카", "아이패드", "아이폰", "아이폰mania", "아이폰메니아", "아자여", "아차산", "아침햇살", "아테네", "아텍스", "아텍스자전거", "아팔란치아", "알뜰구매", "알렉스", "알아쏭", "알톤자전거", "알퐁소", "암스트롱", "애플", "앰티비매니아", "양양", "양준모", "양희", "어바웃", "에르곤", "에어버스", "에이스자전거", "엑스트라", "엑스트라안장", "엘파마", "엠티비라이더", "엠티비매니아", "여주", "여행가", "여행매니아", "여행자", "연우", "엽이", "영규", "영동선", "영배", "영원사이클", "영월", "예수", "예수님", "오대산", "오르트립", "오마이자전거", "오바마", "오버패이스", "오버페이스", "오아시스", "오트리브", "온유", "올뎃바이크", "올리브", "와이키", "와일드바이크", "왈바", "외발자전거", "외사", "요선암", "요선정", "용마산", "용문산", "용순이", "용연동굴", "우룰루", "우산국", "우옥정", "우찬종", "운영자", "울릉도", "울프바이크", "웅재", "원더걸스", "원병철", "원자싸", "원주", "웰고", "웹마스터", "위대한탄생", "유령회원", "유리", "유명산", "유승호", "유시민", "유진바이크", "유코니", "유콘", "육식남", "윤도현", "윤아", "은지원", "이구아나", "이글", "이명박", "이민호", "이상무", "이상민", "이성훈", "이순규", "이순신", "이승기", "이승현", "이웅재", "이은정", "이진기", "이천희", "이탈리아", "이프로", "이현우", "이효리", "인피자", "인피자자전거", "일레븐", "일자산", "일지매", "임계", "임영규", "임윤아", "임재범", "자굴산", "자싸", "자여사", "자유사", "자유영혼", "자유인", "자이언트", "자전거", "자전거가게", "자전거가좋다", "자전거닷컴", "자전거도시", "자전거락", "자전거로", "자전거로만", "자전거로출퇴근하는사람", "자전거로출퇴근하는사람들", "자전거마을", "자전거사랑", "자전거세상", "자전거여행", "자전거여행가", "자전거여행매니아", "자전거여행자", "자전거용품", "자전거이야기", "자전거조아", "자전거좋아", "자전거지킴이", "자전거코스정보", "자전거타기운동연합", "자전거튜닝", "자전거풍경", "자출사", "자코정", "자타청", "작은나무", "작은사람", "작은산", "잠실자전거", "잠실자출사", "장평", "저포스", "전라선", "정달자", "정대형", "정선", "정선군", "정선애인", "정으로달리는자전거", "정조", "정지윤", "제논", "제논스포츠", "제논스포츠인터내셔날", "제로바이크", "제리아", "제마", "제시카", "제주도", "젬스김", "조선", "조세핀", "조양강", "좋은자전거", "주왕산", "주진우", "주천", "주천강", "주천면", "준모", "중미산", "중앙선", "지구", "지구방위대", "지그잭", "지드래곤", "지드레곤", "지리부도", "지양산", "지오코", "지용", "지킴이", "지티", "진부", "쩡셩", "쫄래쫄래", "차도리", "차돌이", "착한아이", "찰리", "창이", "천일동안", "천재소년득기", "철스", "철스MTB", "철스엠티비", "철이", "청령포", "청설모", "청설무", "청송", "청와대", "청춘불패", "청태산", "첼로", "첼로mtb", "첼로바이크", "첼로자전거", "첼시", "초식남", "최민호", "추전역", "치악산", "카라", "카라멜마끼아또", "카릭스", "카멜레온", "카멜백", "카푸치노", "카페라떼", "카페라테", "캣아이", "커스텀", "케논데일", "켄치", "코난", "코스트코바이크", "코스트코자전거", "콜롬비아", "콜바이크", "콧물", "크라이슬러", "키", "키로", "킨곰", "타라바이크", "타사자라", "타사하라", "탐라", "탐라소년", "탑", "태련love", "태민", "태백", "태백산", "태백선", "태양", "태양계", "태연", "1111", "태연러브", "태연사랑", "태연짱", "토마토", "토픽", "톰캣", "투스포츠", "투어매니아", "투에이엠", "투피엠", "트렉", "트렉바이시클", "티아라", "티파니", "파라곤", "파블로", "파워센", "팝콘짱", "패밀리", "팰콘", "평창", "포테이토", "포테토", "풀뫼", "퓨리", "퓨리스", "프리라이더", "플러스", "피리", "피리냐", "피리넷", "피리맨", "피리바이크", "피리자전거", "피오", "피크닉", "픽시", "필더바이크", "필모리스", "하늘자전거", "하라구", "하루", "하빅", "하울링", "하이런전기자전거", "하이시클", "한가람", "한강스포츠", "한강자전거", "한계령", "한국", "한국방송", "한국방송공사", "한국산악자전거", "한국산악자전거협회", "한국외발자전거", "한국외발자전거협회", "한기채", "한라산", "한반도", "한반지지형", "한사람", "한양MTB", "한양엠티비", "함백산", "해를품은달", "해리우스", "해미르", "햄키", "행복한자전거", "헤리우스", "현아", "호남선", "호랑이", "화암", "화암동굴", "화암면", "화암약수", "화암팔경", "황재", "황지연못", "황학산", "횡계", "횡성", "효연", "후니", "후지자전거", "휠러", "흥인지문", "희망자전거", "희망자전거제작소", "희진아빠");;


	//=======================================================
	// 쿼리문__만들기
	$sql	= "INSERT INTO `". $g5['member_table'] ."` SET ";
	$sql .= "mb_id = 'test".$loop_n."', ";
	$sql .= "mb_password = '378b243e220ca493', ";
	$sql .= "mb_name = '".$id_arr[$loop_n]."', ";
	$sql .= "mb_nick = '".$id_arr[$loop_n]."', ";
	$sql .= "mb_nick_date = '".G5_TIME_YMD."', ";
	$sql .= "mb_email = 'test".$loop_n."@test.co.m', ";
	$sql .= "mb_level = 2, ";
	$sql .= "mb_point = 1000, ";
	$sql .= "mb_today_login = '".G5_TIME_YMDHIS."', ";
	$sql .= "mb_login_ip = '119.194.189.206', ";
	$sql .= "mb_datetime = '".G5_TIME_YMDHIS."', ";
	$sql .= "mb_ip = '119.194.189.206', ";
	$sql .= "mb_email_certify = '".G5_TIME_YMDHIS."', ";
	$sql .= "mb_mailling = 1, ";
	$sql .= "mb_sms = 0, ";
	$sql .= "mb_open = 1, ";
	$sql .= "mb_open_date = '".G5_TIME_YMD."'";
	sql_query ($sql);

	#########################################################
	# 끝 => 저장하기
	#########################################################



	#########################################################
	# 시작 => 페이지__이동
	#########################################################

	//=======================================================
	// 순서__증가
	$loop_n++;


	//=======================================================
	// 이동할__페이지
	$go_url_s = "./member_make.php?loop_n=".$loop_n;


	//=======================================================
	// 이동_대기_시간
	$move_time_n = $loop_n%50 == 0 ? 1 : 0;


	//=======================================================
	// 에러
	echo "<meta http-equiv='refresh' content='".$move_time_n.";url=".$go_url_s."' />";
	EXIT;

	#########################################################
	# 끝 => 회원수__새로고침_하기
	#########################################################


?>