<?php

/*
===========================================================

	프로젝트 이름 : 피리 웹프로그램

	만든사람 : 피리 PIREE

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2014년 03월 06일 목요일 오전 09시 47분, 날씨 꽃샘추위 위세가 좀 쎄다, 쌀쌀하다

	저 작 권 : Copyright ⓒ 2014-2015 투스포츠 (원병철) All right reserved
							그누보드 외에 추가된 소스는~
							만든사람의 허락없이 무단으로 사용할수 없습니다.
							사용하고자 할 경우 만든사람의 허락을 받아야 합니다.
							http://www.piree.co.kr 에 문의해 주세요.

===========================================================
 피리 > 피리 신고하기 PLUS G5 > 신고하기 CONFIG 화일
===========================================================


4294967294


18446744073709551614


*/


	#########################################################
	# 시작 => 접근__유효__확인
	#########################################################

	//=======================================================
	// 개별_페이지__접근_불가
	IF (!defined('_GNUBOARD_'))											EXIT;

	#########################################################
	# 끝 => 접근__유효__확인
	#########################################################



###########################################################
# 시작 => 기본_설정_첨부__하기
###########################################################


	//=======================================================
	// 시작 => 기본_설정_첨부__하기
	IF ($is_get__piree_config == 1)
	{

		//=====================================================
		// 설정_디렉토리_이름
		$piree_prog_plus_dir_s = 'p__'.PIREE_PROG_PLUS_MENU_N;


		//=====================================================
		// 설정_정보_파일__경로
		$piree_index_config_path = PIREE_CONFIG_PATH .'/'. $piree_prog_plus_dir_s."/pi__config.php";


		//=====================================================
		// 레벨__설정_정보_파일__경로
		include_once($piree_index_config_path);

	}
	// 끝 => 기본_설정_첨부__하기
	//=======================================================


###########################################################
# 끝 => 기본_설정_첨부__하기
###########################################################








###########################################################
# 시작 => 설정
###########################################################


	//=======================================================
	// 프로그램_번호
	$g_program_n = 770006;


	//=======================================================
	// 프로그램_코드
	$g_program_c = "PIREE Report PLUS G5";


	//=======================================================
	// 프로그램_이름
	$g_program_s = "신고하기 PLUS G5";


	//=======================================================
	// 버젼
	$g_program_version_s = "0.1.2";


	//=======================================================
	// 테이블__생성_여부
	$g_program_is_create = true;


	//=======================================================
	// 무료_유료__여부
	$is_paid = 1;


	//=======================================================
	// 프로그램_메모
	$prog_memo_s = "( 유료 ) 그누보드 G5용 신고하기 하는 프로그램 입니다.";


###########################################################
# 끝 => 설정
###########################################################








###########################################################
# 시작 => 테이블__이름
###########################################################


	//=======================================================
	// 신고하기__항목__테이블
	$piree_table['report_reason'] = G5_TABLE_PREFIX.'_piree_'.$g_program_n.'_report_reason';


	//=======================================================
	// 신고하기__기록__테이블
	$piree_table['report_list'] = G5_TABLE_PREFIX.'_piree_'.$g_program_n.'_report_list';

	//============== 2016-07-28 by Bryan Park =============
	// 블라인드__상태인__게시물__테이블
	$piree_table['blinded_list'] =  G5_TABLE_PREFIX.'_piree_'.$g_program_n.'_blinded_list';


###########################################################
# 끝 => 테이블__이름
###########################################################








###########################################################
# 시작 => 함수
###########################################################


	#########################################################
	# 시작 => 신고__구분
	#########################################################
	function get__report_div($div_c, $bo_table="")
	{

		//=====================================================
		// 전역_변수
		global $g5;


		//=====================================================
		// 넘겨줄_변수
		$report_prog_arr = array();


		//=====================================================
		// 시작 => 프로그램__구분
		SWITCH ($div_c)
		{

			#####################################################
			# 시작 => 게시물
			CASE "article" :

				//=================================================
				// 신고_대상_구분
				$report_prog_arr["prog_s"] = "게시물";


				//=================================================
				// 쿼리문_조건절__필드
				$report_prog_arr["fd_s"] = "prog_article";


				//=================================================
				// 자료_테이블__전체이름 - 게시물__테이블
				$report_prog_arr["arti_table"] = $g5['write_prefix'].$bo_table;

			BREAK;
			# 끝 => 게시물
			#####################################################


			#####################################################
			# 시작 => 댓글
			CASE "comment" :

				//=================================================
				// 신고_대상_구분
				$report_prog_arr["prog_s"] = "댓글";


				//=================================================
				// 쿼리문_조건절__필드
				$report_prog_arr["fd_s"] = "prog_comment";


				//=================================================
				// 자료_테이블__전체이름 - 댓글_테이블
				$report_prog_arr["arti_table"] = $g5['write_prefix'].$bo_table;

			BREAK;
			# 끝 => 댓글
			#####################################################


			#####################################################
			# 시작 => 회원
			CASE "member" :

				//=================================================
				// 신고_대상_구분
				$report_prog_arr["prog_s"] = "회원";


				//=================================================
				// 쿼리문_조건절__필드
				$report_prog_arr["fd_s"] = "prog_member";


				//=================================================
				// 자료_테이블__전체이름 - 회원_테이블
				$report_prog_arr["arti_table"] = $g5['member_table'];

			BREAK;
			# 끝 => 회원
			#####################################################

		}
		// 끝 => 프로그램__구분
		//=====================================================


		//=====================================================
		// 넘겨주기
		return $report_prog_arr;

	}
	#########################################################
	# 끝 => 신고__구분
	#########################################################



	#########################################################
	# 시작 => 신고된__게시물_보기__링크
	#########################################################
	function get_report_row_url($get_type, $div_c, $bo_table="", $wr_id=0, $parent_n=0, $mb_id="")
	{

		//=====================================================
		// 전역_변수
		global $g5;


		//=====================================================
		// 넘겨줄_변수
		$report_link_arr = array();


		//=====================================================
		// 시작 => 넘겨줄_URL__구분__기본값
		IF ($get_type != 'admin_url')
		{
			$get_type = 'user_url';
		}
		// 끝 => 넘겨줄_URL__구분__기본값
		//=====================================================


		//=====================================================
		// 시작 => 프로그램__구분
		SWITCH ($div_c)
		{

			#####################################################
			# 시작 => 게시물
			CASE "article" :

				// 사용자_링크
				$report_link_arr["user_url"] = G5_BBS_URL."/board.php?bo_table=".$bo_table."&wr_id=".$wr_id;

				// 관리자_링크
				$report_link_arr["admin_url"] = $report_link_arr["user_url"];

			BREAK;
			# 끝 => 게시물
			#####################################################


			#####################################################
			# 시작 => 댓글
			CASE "comment" :

				// 사용자_링크
				$report_link_arr["user_url"] = G5_BBS_URL."/board.php?bo_table=".$bo_table."&wr_id=".$parent_n."#c_".$wr_id;

				// 관리자_링크
				$report_link_arr["admin_url"] = $report_link_arr["user_url"];

			BREAK;
			# 끝 => 댓글
			#####################################################


			#####################################################
			# 시작 => 회원
			CASE "member" :

				// 사용자_링크
				$report_link_arr["user_url"] = G5_BBS_URL."/profile.php?mb_id=".$mb_id;

				// 관리자_링크
				$report_link_arr["admin_url"] = G5_ADMIN_URL."/member_form.php?w=u&mb_id=".$mb_id;

			BREAK;
			# 끝 => 회원
			#####################################################

		}
		// 끝 => 프로그램__구분
		//=====================================================


		//=====================================================
		// 넘겨주기
		return $report_link_arr[$get_type];

	}
	#########################################################
	# 끝 => 신고된__게시물_보기__링크
	#########################################################



	#########################################################
	# 시작 => 게시물_수_댓글_수__새로고침
	#########################################################
	function realod_row_count($prog_div_c, $bo_table, $wr_id)
	{

			//===================================================
			// 외부_상수_변수
			global $g5, $write_table, $write;


			//===================================================
			// 시작 => 프로그램__구분
			SWITCH ($prog_div_c)
			{

				###################################################
				# 시작 => 게시물
				###################################################
				CASE "article" :

					//===============================================
					// 시작 => 게시판_코드__있으면
					IF ($bo_table)
					{

							//===========================================
							// 게시판_에_게시물_수__파악
							// $sql = "SELECT COUNT(*) FROM `".$write_table."` WHERE wr_is_comment='0' AND wr_pi_report_t=0";
							$sql = "SELECT COUNT(*) FROM `".$write_table."` WHERE wr_is_comment='0'";
							$article_t = sql_efv($sql);


							//===========================================
							// 게시판에_게시물_수__새로고침
							$sql = "UPDATE `".$g5['board_table']."` SET bo_count_write='".$article_t."' WHERE bo_table='".$bo_table."'";
							sql_query ($sql);

					}
					// 끝 => 게시판_코드__있으면
					//===============================================

				BREAK;
				###################################################
				# 끝 => 게시물
				###################################################



				###################################################
				# 시작 => 댓글
				###################################################
				CASE "comment" :

					//===============================================
					// 댓글_의_원_게시물
					global $wr_parent;


					//===============================================
					// 시작 => 게시판_코드__원_게시물__있으면
					IF ($bo_table && $wr_parent > 0)
					{

							//===========================================
							// 게시물_에_댓글_수__파악
							// $sql = "SELECT COUNT(*) FROM `".$write_table."` WHERE wr_parent='".$wr_parent."' AND wr_is_comment='1' AND wr_pi_report_t=0";
							$sql = "SELECT COUNT(*) FROM `".$write_table."` WHERE wr_parent='".$wr_parent."' AND wr_is_comment='1'";
							$comment_t = sql_efv($sql);


							//===========================================
							// 게시물_에_댓글_수__새로고침
							$sql = "UPDATE `".$write_table."` SET wr_comment='".$comment_t."' WHERE wr_id='".$wr_parent."'";
							sql_query ($sql);

					}
					// 끝 => 게시판_코드__원_게시물__있으면
					//===============================================

				BREAK;
				###################################################
				# 끝 => 댓글
				###################################################



				###################################################
				# 시작 => 회원
				###################################################
				CASE "member" :

					//===============================================
					//


					//===============================================
					//

				BREAK;
				###################################################
				# 끝 => 회원
				###################################################

			}
			// 끝 => 프로그램__구분
			//===================================================

	}
	#########################################################
	# 끝 => 게시물_수_댓글_수__새로고침
	#########################################################


###########################################################
# 끝 => 함수
###########################################################








###########################################################
# 시작 => 신고하기__설정_정보__가져오기
###########################################################


	#########################################################
	# 시작 => 피리_프로그램_정보__가져오는__함수
	#########################################################
	function get__prog_info__770006($prog_n)
	{

		//=====================================================
		// 전역_변수
		global $piree_table, $is_piree_program_config;


		//=====================================================
		// 넘겨줄__배열_변수
		$prog_info = array();


		//=====================================================
		// 시작 => 피리_프로그램_번호__있으면
		IF ($prog_n > 0)
		{

			//===================================================
			// 피리_프로그램_정보__가져오기
			$sql = "SELECT * FROM `".$piree_table['program']."` WHERE `prog_n` = ".$prog_n;
			$row = sql_fetch($sql, false);


			//===================================================
			// 시작 => 칼럼__없으면
			IF (!isset($row['prog_n']))
			{

				//=================================================
				// 외부_상수_변수
				global $is_admin;


				//=================================================
				// 시작 => 운영자_일반회원__여부
				IF ($is_admin)
				{

					#################################################
					# 시작 => 운영자__이면

					//===============================================
					// 시작 => 설정_화면__아니면
					IF ($is_piree_program_config != 1)
					{

							// 이동할__페이지
							$move_url = G5_ADMIN_URL.'/p'.PIREE_PROG_PLUS_MENU_N.'/';

							// 에러_알림
							alert ("선택하신 프로그램이 설치되지 않았거나 DB정보가 없습니다. 770006", $move_url);

					}
					// 끝 => 설정_화면__아니면
					//===============================================

				}
				ELSE
				{

					#################################################
					# 시작 => 일반회원__이면

					// 에러_알림
					alert ("선택하신 프로그램이 설치되지 않았거나 DB정보가 없습니다. 770006", G5_URL);

				}
				// 끝 => 운영자_일반회원__여부
				//=================================================

			}
			// 끝 => 칼럼__없으면
			//===================================================


			//===================================================
			// 시작 => 피리_프로그램_번호__맞으면
			IF ($prog_n == $row['prog_n'])
			{

				//=================================================
				// 피리_프로그램_정보__배열
				$prog_info = $row;

			}
			// 끝 => 피리_프로그램_번호__맞으면
			//===================================================

		}
		// 끝 => 피리_프로그램_번호__있으면
		//=====================================================


		//=====================================================
		// 피리_프로그램_정보
		return $prog_info;

	}
	#########################################################
	# 끝 => 피리_프로그램_정보__가져오는__함수
	#########################################################



	#########################################################
	# 시작 => 신고하기__설정_정보__가져오는__함수
	#########################################################
	function get__report_config()
	{

		//=====================================================
		// 전역_변수
		global $g_program_n, $piree_table, $is_get__piree_config;


		//=====================================================
		// 프로그램_정보__배열
		$report_config = array();


		//=====================================================
		// 프로그램_번호
		$report_config['g_program_n'] = $g_program_n;


		//=====================================================
		// 시작 => 피리_프로그램__테이블__유무
		IF (isset($piree_table['program']) && $is_get__piree_config == 1)
		{

			//===================================================
			// 피리_프로그램_정보__가져오기
			$report_config = get__prog_info($g_program_n);

		}
		ELSE
		{

			//===================================================
			// 피리_프로그램_정보__가져오기
			$report_config = get__prog_info__770006($g_program_n);

		}
		// 끝 => 피리_프로그램__테이블__유무
		//=====================================================


		//=====================================================
		// 프로그램__디렉토리
		$report_config['prog_dir'] = "p".$g_program_n."__report";


		//=====================================================
		// 프로그램__경로
		$report_config['prog_u'] = PIREE_URL . "/" . $report_config['prog_dir']."/";
		$report_config['prog_p'] = PIREE_PATH . "/" . $report_config['prog_dir']."/";


		//=====================================================
		// 시작 => 프로그램_번호__맞으면
		IF ($g_program_n == $report_config['prog_n'])
		{

			//===================================================
			// 시작 => 스킨_PC__이면
			IF ($report_config['skin_pc_c'] != "")
			{

				//=================================================
				// 스킨_PC
				$report_config['skin_pc_c'] = $report_config['skin_pc_c'];
				$report_config['skin_pc_u'] = PIREE_SKIN_PC_URL . "/" . $report_config['prog_dir'] .'/'. $report_config['skin_pc_c'];
				$report_config['skin_pc_p'] = PIREE_SKIN_PC_PATH . "/" . $report_config['prog_dir'] .'/'. $report_config['skin_pc_c'];

			}
			// 끝 => 스킨_PC__이면
			//===================================================


			//===================================================
			// 시작 => 스킨_모바일__이면
			IF ($report_config['skin_mobile_c'] != "")
			{

				// 스킨_모바일
				$report_config['skin_mobile_c'] = $report_config['skin_mobile_c'];
				$report_config['skin_mobile_u'] = PIREE_SKIN_MOBILE_URL . "/" .$report_config['prog_dir'] .'/'. $report_config['skin_mobile_c'];
				$report_config["skin_mobile_p"] = PIREE_SKIN_MOBILE_PATH . "/" .$report_config['prog_dir'] .'/'. $report_config['skin_mobile_c'];

			}
			// 끝 => 스킨_모바일__이면
			//===================================================


			//===================================================
			// 시작 => 블라인드__처리할__신고_건수__이면
			IF ($report_config["pp_cf_1_c"] == "blind_do_t")
			{

				// 블라인드__처리할__신고_건수
				$report_config["blind_do_t"] = $report_config["pp_cf_1_n"];

			}
			// 끝 => 블라인드__처리할__신고_건수__이면
			//===================================================


			//===================================================
			// 시작 => 신고_가능한__레벨__이면
			IF ($report_config["pp_cf_2_c"] == "report_do_level_n")
			{

				// 신고_가능한__레벨
				$report_config["report_do_level_n"] = $report_config["pp_cf_2_n"];

			}
			// 끝 => 신고_가능한__레벨__이면
			//===================================================


			//===================================================
			// 시작 => 신고_면제_할__레벨__이면
			IF ($report_config["pp_cf_3_c"] == "exemption_level_n")
			{

				// 신고_면제_할__레벨
				$report_config["exemption_level_n"] = $report_config["pp_cf_3_n"];

			}
			// 끝 => 신고_면제_할__레벨__이면
			//===================================================


			//===================================================
			// 시작 => 신고_면제_할__가입일수__이면
			IF ($report_config["pp_cf_4_c"] == "exemption_day_n")
			{

				// 신고_면제_할__가입일수
				$report_config["exemption_day_n"] = $report_config["pp_cf_4_n"];

			}
			// 끝 => 신고_면제_할__가입일수__이면
			//===================================================


			//===================================================
			// 시작 => 신고_한__회원의_포인트__이면
			IF ($report_config["pp_cf_5_c"] == "report_do_point_n")
			{

				// 신고_한__회원의_포인트
				$report_config["report_do_point_n"] = $report_config["pp_cf_5_n"];

			}
			// 끝 => 신고_한__회원의_포인트__이면
			//===================================================


			//===================================================
			// 시작 => 신고_당한__회원의_포인트__이면
			IF ($report_config["pp_cf_6_c"] == "report_get_point_n")
			{

				// 신고_당한__회원의_포인트
				$report_config["report_get_point_n"] = $report_config["pp_cf_6_n"];

			}
			// 끝 => 신고_당한__회원의_포인트__이면
			//===================================================


			//===================================================
			// 시작 => 무분별한__신고시_신고_한__회원의_포인트__이면
			IF ($report_config["pp_cf_7_c"] == "report_rash_point_n")
			{

				// 무분별한__신고시_신고_한__회원의_포인트
				$report_config["report_rash_point_n"] = $report_config["pp_cf_7_n"];

			}
			// 끝 => 무분별한__신고시_신고_한__회원의_포인트__이면
			//===================================================


			//===================================================
			// 시작 => 무분별한_신고시__신고_권한__제한__이면
			IF ($report_config["pp_cf_8_c"] == "report_rash_auth_n")
			{

				// 무분별한_신고시__신고_권한__제한
				$report_config["report_rash_auth_n"] = $report_config["pp_cf_8_n"];

			}
			// 끝 => 무분별한_신고시__신고_권한__제한__이면
			//===================================================

		}
		// 끝 => 프로그램_번호__맞으면
		//=====================================================


		//=====================================================
		// 신고하기___설정
		// 넘겨줄_변수
		return $report_config;

	}
	#########################################################
	# 끝 => 신고하기__설정_정보__가져오는__함수
	#########################################################

	###########################################################
	# 시작 => 2016-07-28 블라인드된 게시물 목록 테이블에 저장하는 함수 by Bryan Park
	###########################################################
	function add__blinded_list() {
		global $g5, $rp_num, $bo_table, $wr_id,$prog_div_c, $board,$report_title_s,$report_get_mem_id;
		$blindedListTB = "g5__piree_770006_blinded_list"; //2016-07-07 by Bryan Park - 신고/차단 회원 테이블.
		
		$mb_info = sql_fetch("SELECT * FROM `".$g5['member_table']."` WHERE mb_id='".$report_get_mem_id."'"); //2016-07-07 by Bryan Park - 신고 당한 회원정보.

		$blinded_sql = ""; //2016-07-07 by Bryan Park - 블랙리스트 테이블에 회원정보 + "게시물:게시판"(사유)을 넣게 위한 쿼리문. 
		//2016-07-07 by Bryan Park - 추가 - 블랙리스트 테이블에 정보 입력 - bl_active 는 기존의 isCheck
		$blinded_sql = "INSERT INTO ".$blindedListTB." (mb_id, mb_ip, rp_num, prog_div_c, bo_table, wr_id, bl_comment, bl_active, bl_date) "; // regdate는 
		//bl_date는 블랙리스트 된 것. NOW() 로 설정하도록.
		//2016-07-28 블라인드된 게시물 목록 테이블에 insert 하기 위한 query가 필요하다. by Bryan Park
		
		$blinded_sql .= " VALUES (";
		$blinded_sql .= "'".$mb_info['mb_id']."', ";
		$blinded_sql .= "'".$mb_info['mb_ip']."', "; 
		$blinded_sql .= "'".$rp_num."', ";// 2016-07-12 report_list 테이블에 insert 후 sql_insert_id()함수로 가져온 num값. by Bryan Park
		
		SWITCH($prog_div_c){ //2016-07-08 by Bryan Park - 추가 - 게시물 신고, 댓글 신고, 회원 신고에 따라서 다른 커맨트를 입력하게끔.[bl_comment]
			CASE "article"://2016-07-08 by Bryan Park => 블랙리스트 사유는 - 게시판 명 : 게시물 제목 형식으로 이뤄진다 
				$blinded_sql .= "'".$prog_div_c."', ";// 2016-07-12 prog_div_c[신고 대상 분류] by Bryan Park
				$blinded_sql .= "'".$bo_table."', ";// 2016-07-12 신고 대상 게시물이 속한 board by Bryan Park
				$blinded_sql .= "'".$wr_id."', ";// 2016-07-12 신고 대상 게시물의 wr_id by Bryan Park
				$board_subject = $board['bo_subject'];
				$blinded_sql .= "'".$board_subject.":".$report_title_s."', "; //블랙 사유 bl_comment -> 보드테이블명, 게시물제목.
				$blinded_sql .= "'Y', ";
				$report_shutdown = 1;
				break;
			CASE "comment"://2016-07-08 by Bryan Park 댓글의 경우엔 내용으로 출력.
				/*
				$blinded_sql .= "'".$prog_div_c."', ";// 2016-07-12 prog_div_c[신고 대상 분류] by Bryan Park
				$blinded_sql .= "'".$bo_table."', ";// 2016-07-12 신고 대상 게시물이 속한 board by Bryan Park
				$blinded_sql .= "'".$wr_id."', ";// 2016-07-12 신고 대상 게시물의 wr_id by Bryan Park
				$board_subject = $board['bo_subject'];
				$blinded_sql .= "'[[댓]]".$board_subject.":".$report_title_s."', "; //블랙 사유 bl_comment
				*/
				$report_shutdown = 0;
				break;
			CASE "member":
				/*
				$blinded_sql = "'".$prog_div_c."', ";// 2016-07-12 prog_div_c[신고 대상 분류] by Bryan Park
				$blinded_sql .= "'', ";// 2016-07-12 신고 대상 게시물이 속한 board by Bryan Park
				$blinded_sql .= "0, ";// 2016-07-12 신고 대상 게시물의 wr_id by Bryan Park
				$blinded_sql .= "'회원 신고로 인한 차단', "; //블랙 사유 bl_comment
				*/
				$report_shutdown = 0;
				break;				
		}
		
		$blinded_sql .= "NOW()"; //bl_date를 현시간으로.
		$blinded_sql .=")";
		//2016-07-07 by Bryan Park - 주석 -> P로 차단 당한 사람이 재차 블라인드 먹으면 또 P로 차단당함.
		
		if($report_shutdown){//2016-07-08 by Bryan Park - 회원 차단 실행
			//2016-07-07 by Bryan Park  - 완성된 쿼리로 블랙리스트 테이블에 회원정보를 삽입, 에러시 에러 반환.
			if(!sql_query($blinded_sql)){
				// 에러_메세지//2016-07-08 by Bryan Park 
				$save_err_msg = $prog_div_c."게시물 블라인드 내역 저장을 적용하지 못했습니다.";

				// 에러
				alert_close ($save_err_msg);
				EXIT;
			}
		}
		//echo "<javascript>console.log('{$blinded_sql}');</javascript>";
	}//end of function

	###########################################################
	# 끝 => 2016-07-28 블라인드된 게시물 목록 테이블에 저장하는 함수 by Bryan Park
	###########################################################	


	###########################################################
	# 시작 => 2016-07-28 블라인드된 게시물 목록 테이블에서 삭제하는 함수 by Bryan Park
	###########################################################
	function delete__blinded_list($bo_table, $wr_id) {
		$blindedListTB = "g5__piree_770006_blinded_list"; 
		$blinded_sql = "UPDATE ".$blindedListTB;
		$blinded_sql .= " SET `bl_active` = 'N' WHERE bo_table ='".$bo_table."' AND wr_id = '".$wr_id."'";
		echo $blinded_sql;
		if(!sql_query($blinded_sql)){
			// 에러_메세지//2016-07-08 by Bryan Park 
			$save_err_msg = $blinded_sql.$prog_div_c."게시물을 블라인드 목록에서 해제하지 못했습니다.";

			// 에러
			alert_close ($save_err_msg);
			EXIT;
		}
	}
	###########################################################
	# 끝 => 2016-07-28 블라인드된 게시물 목록 테이블에서 삭제하는 함수 by Bryan Park
	###########################################################


	#########################################################
	# 시작 => 신고하기__설정_정보__가져오기
	#########################################################

	//=======================================================
	// 신고하기___사용여부
	// 0 - 안함
	// 1 - 사용함
	$is_use_report = 0;


	//=======================================================
	// 시작 => 신고하기__설정_정보__가져오기__이면
	IF ($is_get__report == 1)
	{

		//=====================================================
		// 신고하기__정보__가져오기
		$report_config = get__report_config();


		//=====================================================
		// 시작 => 프로그램_번호__있으면
		IF ($g_program_n == $report_config['g_program_n'])
		{

			//===================================================
			// 신고하기___사용여부
			// 1 - 사용함
			$is_use_report = 1;

		}
		// 끝 => 프로그램_번호__있으면
		//=====================================================

	}
	// 끝 => 신고하기__설정_정보__가져오기__이면
	//=======================================================

	#########################################################
	# 끝 => 신고하기__설정_정보__가져오기
	#########################################################


###########################################################
# 끝 => 신고하기__설정_정보__가져오기
###########################################################


?>