<?php

/*
===========================================================

	프로젝트 이름 : Piree Web Program

	만든사람 : 피리 PIREE

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2015년 월 일 오전 오후 시 분 - 날씨 

	저 작 권 : Copyright ⓒ 2014-2015 투스포츠 (원병철) All right reserved
							그누보드 외에 추가된 소스는~
							만든사람의 허락없이 무단으로 사용할수 없습니다.
							사용하고자 할 경우 만든사람의 허락을 받아야 합니다.
							http://www.piree.co.kr 에 문의해 주세요.

===========================================================
 피리 > HTML HEAD 안에 집어넣어


*/


	#########################################################
	# 시작 => 접근__유효__확인
	#########################################################

	//=======================================================
	// 개별_페이지__접근_불가
	IF (!defined('_GNUBOARD_'))										EXIT;

	#########################################################
	# 끝 => 접근__유효__확인
	#########################################################



	#########################################################
	# 시작 => STYLE
	#########################################################

	//=======================================================
	// 시작 => DEVICE__구분
	IF (G5_IS_MOBILE)
	{
?>
			<link rel="stylesheet" href="<?php echo PIREE_CSS_URL ?>/pi__mobile.css">

<?php
	}
	ELSE
	{
?>
			<link rel="stylesheet" href="<?php echo PIREE_CSS_URL ?>/pi__style.css">

<?php
	}
	// 끝 => DEVICE__구분
	//=======================================================

	#########################################################
	# 끝 => STYLE
	#########################################################



	#########################################################
	# 시작 => SCPRIT
	#########################################################

	//=======================================================
	// SCPRIT__상수
?>

			<script src="<?php echo PIREE_JS_URL ?>/pi__piree.js"></script>
			<script src="<?php echo PIREE_JS_URL ?>/jquery.autogrow.js"></script>


			<script>

					//===============================================
					// PIREE__기본_상수
					var piree_url = "<?php echo PIREE_URL; ?>";
					var piree_js_url = "<?php echo PIREE_JS_URL; ?>";

			</script>

<?php

	#########################################################
	# 끝 => SCPRIT
	#########################################################


?>