
/*
===========================================================

	프로젝트 이름 : Piree Web Program

	만든사람 : 피리 PIREE

	홈페이지 : http://www.piree.co.kr

	작성날짜 : 2016년 01월 12일 화요일 오전 02시 19분 - 날씨 한파가 왔다

	저 작 권 : Copyright ⓒ 2014 투스포츠 (원병철) All right reserved
							그누보드 외에 추가된 소스는~
							만든사람의 허락없이 무단으로 사용할수 없습니다.
							사용하고자 할 경우 만든사람의 허락을 받아야 합니다.
							http://www.piree.co.kr 에 문의해 주세요.

===========================================================
 피리 > 피리 게시글에 투표, 복수 질문 FREE G5 > 자바스크립트 > 투표 등록하기
===========================================================


	$('input[name=wr_use_arti_vote_n]').prop("checked", true);


*/


  //#######################################################
  // 시작 => JQ
  //#######################################################
  $(function(){

  		//###################################################
  		// 날짜_선택
  		// $('#atvt_end_date_s').appendDtpicker({ 'locale':'ko', 'autodateOnStart':false, 'minuteInterval':10 });



  		//###################################################
  		// 시작 => 투표__사용__체크_여부
  		if ( $('#wr_use_arti_vote_n').is(':checked') )
  		{

  		    // 투표창__열기
  		    $("#vote_write_form").show();

  		}
  		else
  		{

  		    // 투표창__닫기
  		    $("#vote_write_form").hide();

  		}
  		// 끝 => 투표__사용__체크_여부
  		//###################################################



  		//###################################################
  		// 시작 => 투표__사용
  		$("#wr_use_arti_vote_n").click(function()
  		{

  		    //===============================================
  		    // 시작 => 체크__여부
  		    if($(this).is(":checked"))
  		    {
  		    		// 투표창__열기
  		    		$("#vote_write_form").show();
  		    }
  		    else
  		    {
  		    		// 투표창__닫기
  		    		$("#vote_write_form").hide();
  		    }
  		    // 끝 => 체크__여부
  		    //===============================================

  		});
  		// 끝 => 투표__사용
  		//###################################################

  });
  //#######################################################
  // 끝 => JQ
  //#######################################################




  //#######################################################
  // 시작 => 함수
  //#######################################################

	//*******************************************************
	//** PWP__760015__ARTICLE_VOTE
	//*******************************************************

			//###################################################
			// 시작 => 투표_참여_방법__체크하기
			//###################################################
			function vote_type_check(gform, que_n)
			{

					//===============================================
					// 시작 => FORM__있으면
					if (gform)
					{

							//===========================================
							// 시작 => 투표__질문__있으면
							if ( $('#atvt_que_' + que_n).val() != '')
							{

									//=======================================
									// 투표__사용하는_것__있으면
									var que_use_n = 0;


									//=======================================
									// 객관식__체크_여부
									var vote_type_1 = $('#avl_choice_' + que_n).is(':checked') ? 1 : 0;


									//=======================================
									// 주관식__체크_여부
									var vote_type_2 = $('#avl_subjective_' + que_n).is(':checked') ? 1 : 0;


									//=======================================
									// 투표_항목
									var vote_poll_str = 'atvt_poll_' + que_n;
									var vote_poll_len = vote_poll_str.length;


									//=======================================
									// 투표_이미지
									var vote_image_str = 'atvt_image_' + que_n;
									var vote_image_len = vote_image_str.length;


									//=======================================
									// 시작 => 투표__사용하는_것__없으면
									if ( vote_type_1 != 1 && vote_type_2 != 1 )
									{
											alert ("[투표 #" + que_n + "]의 객관식, 주관식 둘중에 1개 이상을 사용하셔야 합니다.");
											$('#avl_choice_' + que_n).prop('checked', true);
											vote_type_check(gform, que_n);
											$('#avl_choice_' + que_n).focus();
											return false;
									}
									// 끝 => 투표_이미지__이면
									//=======================================


									//=======================================
									// 시작 => 반복문
									for (var i=0; i<gform.elements.length; i++)
									{

											//===================================
											// 시작 => 객관식__체크
											if ( vote_type_1 == true)
											{

													//===============================
													// 시작 => 투표_항목__이면
													if ( gform.elements[i].name.substring(0, vote_poll_len) == vote_poll_str )
													{
															gform.elements[i].disabled = false;
															gform.elements[i].style.color = '#000';
															gform.elements[i].style.backgroundColor = '#f7f7f7';
													}


													//===============================
													// 시작 => 투표_이미지__이면
													if ( gform.elements[i].name.substring(0, vote_image_len) == vote_image_str )
													{
															gform.elements[i].disabled = false;
															gform.elements[i].style.color = '#000';
															gform.elements[i].style.backgroundColor = '#f7f7f7';
													}

											}
											else
											{

													//===============================
													// 시작 => 투표_항목__이면
													if ( gform.elements[i].name.substring(0, vote_poll_len) == vote_poll_str )
													{
															gform.elements[i].disabled = true;
															gform.elements[i].style.color = '#aaa';
															gform.elements[i].style.backgroundColor = '#eee';
													}


													//===============================
													// 시작 => 투표_이미지__이면
													if ( gform.elements[i].name.substring(0, vote_image_len) == vote_image_str )
													{
															gform.elements[i].disabled = true;
															gform.elements[i].style.color = '#aaa';
															gform.elements[i].style.backgroundColor = '#eee';
													}

											}
											// 끝 => 객관식__체크
											//===================================

									}
									// 끝 => 반복문
									//=======================================

							}
							// 끝 => 투표__질문__있으면
							//===========================================

					}
					// 끝 => FORM__있으면
					//===============================================

					return true;

			}
			//###################################################
			// 끝 => 투표_참여_방법__체크하기
			//###################################################



  		//###################################################
  		// 시작 => 날짜__RADIO_버튼__선택
  		//###################################################
  		function choice_date(radio_date_s)
  		{

  		    //===============================================
  				// 시작 => 선택된_날짜__있으면
  				if (radio_date_s)
  				{
  						$("#atvt_end_date_Ymd").val(radio_date_s);
  				}
  				// 끝 => 선택된_날짜__있으면
  		    //===============================================

  		}
  		//###################################################
  		// 끝 => 날짜__RADIO_버튼__선택
  		//###################################################



  		//###################################################
  		// 시작 => 투표_정보__입력_확인_하기
  		//###################################################
  		function check_vote_form(gform)
  		{

  		    //===============================================
  				// 시작 => 투표__제목
					if (!gform.atvt_title_s.value || gform.atvt_title_s.value == "")
					{
							alert("\"게시글에 투표\" 하시려면 [투표 제목]을 입력해 주세요.");
							gform.atvt_title_s.focus();
							return false;
					}
  				// 끝 => 투표__제목
  		    //===============================================


  		    //===============================================
  				// 시작 => 반복문
					for (var i=1; i<11; i++)
					{

							//===========================================
							// 시작 => 투표_참여_방법__체크하기
							if ( !vote_type_check(gform, i) )
							{
									alert ( vote_type_check(gform, i) );
									return false;
							}
							// 끝 => 투표_참여_방법__체크하기
							//===========================================

					}
  				// 끝 => 반복문
  		    //===============================================


/*

  		    //===============================================
  				// 시작 => 투표__마감_날짜
					if (!gform.atvt_end_date_Ymd.value || gform.atvt_end_date_Ymd.value == "")
					{
							alert("\"게시글에 투표\" 하시려면 [투표 마감 날짜]를 입력해 주세요.");
							gform.atvt_end_date_Ymd.focus();
							return false;
					}
  				// 끝 => 투표__마감_날짜
  		    //===============================================


  		    //===============================================
  				// 시작 => 투표__마감_시간
					if (!gform.atvt_end_date_H.value || gform.atvt_end_date_H.value == "")
					{
							alert("\"게시글에 투표\" 하시려면 [투표 마감 시간]를 입력해 주세요.");
							gform.atvt_end_date_H.focus();
							return false;
					}
  				// 끝 => 투표__마감_시간
  		    //===============================================


  		    //===============================================
  				// 시작 => 투표__마감_분
					if (!gform.atvt_end_date_i.value || gform.atvt_end_date_i.value == "")
					{
							alert("\"게시글에 투표\" 하시려면 [투표 마감 분]를 입력해 주세요.");
							gform.atvt_end_date_i.focus();
							return false;
					}
  				// 끝 => 투표__마감_분
  		    //===============================================


  		    //===============================================
  				// 시작 => 투표__항목_1
					if (!gform.atvt_poll_1.value || gform.atvt_poll_1.value == "")
					{
							alert("\"게시글에 투표\" 하시려면 [투표 항목 1]을 입력해 주세요.");
							gform.atvt_poll_1.focus();
							return false;
					}
  				// 끝 => 투표__항목_1
  		    //===============================================


  		    //===============================================
  				// 시작 => 투표__항목_2
					if (!gform.atvt_poll_2.value || gform.atvt_poll_2.value == "")
					{
							alert("\"게시글에 투표\" 하시려면 [투표 항목 2]를 입력해 주세요.");
							gform.atvt_poll_2.focus();
							return false;
					}
  				// 끝 => 투표__항목_2
  		    //===============================================

*/


  		    //===============================================
  				// 이상없이__통과
  				return true;

  		}
  		//###################################################
  		// 끝 => 투표_정보__입력_확인_하기
  		//###################################################

  //#######################################################
  // 끝 => 함수
  //#######################################################

